const csc = [
    {
        Id: "1",
        question: "مسئلہ سے کیا مراد ہے؟",
        content: "نا پسندیدہ عمل جسکو درست کرنے کی ضرورت ہوتی ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "2",
        question: "مسئلہ  حل کرنے کے مراحل کے نام بتائیں۔",
        content: "مسئلہ کا تعین، مسئلے کو سمجھنا ، حل کی منصوبہ بندی، کینڈڈ سلوشن ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "3",
        question: "مسئلہ کے تعین سے کیا مراد ہے؟",
        content: "تمام بنیادی باتیں واضح طور پر متعین کی گئی ہوں، یہ واضح منزل رکھتا ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "4",
        question: "تقسیم کریں اور فتح حاصل کریں کی حکمت عملی بتائیں۔",
        content: "یہ حکمت عملی پچیدہ مسئلے کو چھوٹے مسئلوں میں تقسیم کرتی ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "5",
        question: "ایکٹ اٹ آوٹ سے کیا مراد ہے؟",
        content: "ڈیزانر کاموں کی فہرست تیار کرتا ہے۔ اور ہر کام کو سر انجام دیتا ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "6",
        question: "\"ٹیکنیک \"\" نمونہ \"\" سے کیا مراد ہے؟ \"",
        content: "یہ مسئلے کا آخری حل نہیں ہے تاہم ڈیزانر کی مدد کر سکتا ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "7",
        question: "کینڈڈ سلوشن سے کیا مراد ہے؟ ",
        content: "غیر منصوبہ بندی کا حوالہ دیتا ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "8",
        question: "ٹیسٹ ڈیٹا سے کیا مراد ہے؟ ",
        content: "مسئلے کو حل کرنے کے بعد اسکو ٹیسٹ کیا جاتا ہے کہ حل درست ہے یا نہیں۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "9",
        question: "درست ٹیست ڈیٹا اور نا درست ٹیسٹ ڈیٹا میں فرق",
        content: "دی گئی ان پٹ الگورتھم کے تقاضوں کے عین مطابق ہوتی ہے۔  نا درست ڈیٹا الگورتھم کے تقاضوں سے ہم آہنگی نہیں رکھتا۔  ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "10",
        question: "باؤنڈری ٹیسٹ ڈیٹا  سے کیا مراد ہے؟",
        content: "حل کو انتہائی اقدار کے لئے ٹیسٹ کیا جاتا ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "11",
        question: "ڈیٹا کا غلط نمونہ ٹیسٹ ڈیٹا سے کیا مراد ہے؟",
        content: "الگورتھم کو غلط نمونہ کے لئے ٹیسٹ کیا جا ئے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "12",
        question: "عدم دستیاب ڈیٹا کیا ہوتا ہے؟ ",
        content: "الگورتھم کو اسکی ضرورت سے کم ان پٹ دیکر ٹیسٹ کیا جائے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "13",
        question: "ٹریس ٹیبل سے کیا مراد ہے؟",
        content: "الگورتھم کے جائزے کو ٹیسٹ کرنے کے لئے اسے استعمال کیا جاتا ہے۔  اس میں ڈیٹا کو کالم اور ویلیو کو قطار سے ظاہر کیا جاتا ہے۔",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "14",
        question: "\"ٹریس ٹیبل میں \"\"خالی \"\" اور \"\" - - \"\" سے کیا مراد ہے؟\"",
        content: "\"\"\"خالی\"\" سے مراد کوئی تبدیلی نہیں اور \"\" - - \"\" سے مراد ویلیو کا کوئی تعلق نہیں۔ \"",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "15",
        question: "لوجیکل ایرر سے کیا مراد ہے؟ ",
        content: "ایسا ایرر جو منطق کے خلاف ہو جیسے 5 کو 0 سے تقسیم کرنا۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "16",
        question: "ویری فیکیشن اور ویلیڈیشن میں فرق بیان کریں۔",
        content: "ویری فیکیشن سے مراد حل درست رزلٹ دے رہا ہے یا نہیں اور ویلیڈیشن سے مراد خاص مسئلے کی نوعیت  عین مطابق ہیں۔",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "17",
        question: "الگورتھم اور فلو چارٹ میں فرق بیان کریں۔",
        content: "الگورتھم مسئلہ حل کرنے کے مراحل کے مجموعے کا نام ہے۔ الگورتھم کا تصویری اظہار فلو چارٹ کہلاتا ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "18",
        question: "فلو چارٹ کی علامات بیان کریں۔",
        content: "فلو لائن، ٹرمینل ، عمل، فیصلہ سازی، ان پٹ/ آوٹ پٹ ، کنیکٹر ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "19",
        question: "فلو چارٹ میں ان پٹ اور آوٹ پٹ میں فرق بیان کریں",
        content: "ان پٹ سے مراد صارف سے ڈیٹا لینا ہے اور آوٹ پٹ معلومات کو ظاہر کرنے کے لئے استعمال کیا جاتا ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "20",
        question: "فلوچارٹ کے فائدے اور نقصانات بیان کریں۔",
        content: "فلو چارٹ بنانا آسان ہے۔ مسئلہ کو حل کرنے میں آسانی ہوتی ہے۔ اسمیں ترمیم آسان نہیں ہوتی۔ زیادہ وقت درکار ہوتا ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "21",
        question: "الگورتھم کے  فائدے اور نقصانات بیان کریں۔",
        content: "الگوتھم آسانی سے لکھا جا سکتا ہے۔ تکنیک سمجھنا آسان ہے۔۔ الگورتھم میں بہاو دیکھانا ممکن نہ ہے۔ ",
        chapter: "C1",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "22",
        question: "نمبر سسٹم سے کیا مراد ہے؟ ",
        content: "عددی نظام اعداد و شمار کی نمائندگی کے لئے ایک سسٹم استعمال کرتا ہے۔ جسے نمبر سسٹم کہتے ہیں۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "23",
        question: "نمبر سسٹم کی اقسام کے نام لکھیں۔ ",
        content: "اعشاری عددی نظام  ،  بائنری نمبر سسٹم ،   ہیگزا ڈیسمل نمبر سسٹم   ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "24",
        question: "اعشاری نطام سے کیا مراد ہے؟ ",
        content: "اعشاری عددی نظام کی بنیاد 10 ہے۔ یہ 0 سے لیکر 9 عدد پر مشتمل ہوتا ہے۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "25",
        question: "ثنائی عددی نظام کیا ہے؟ ",
        content: "ثنائی عددی نظام کی بنیاد  2 ہے۔ یہ 0، 1 ہندسے پر مشتمل ہوتا ہے۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "26",
        question: "آسکی کوڈ کیا ہے؟ ",
        content: "یہ کمپیوٹر میموری میں ڈیٹا کی نمائندگی کے لئے ایک ڈی-فیکٹو سٹینڈرڈ ہے۔ کمپیوٹر  ڈیٹا بائنری شکل میں محفوظ کرتا ہے۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "27",
        question: "میموری سے کیا مراد ہے؟ اسکی اقسام بتائیں۔ ",
        content: "ایسا مادی آلہ جو ڈیٹا کو محفوظ کرنے کے قابل ہوتا ہے، اسکی دو اقسام ہیں۔ ریم اور روم ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "28",
        question: "وولاٹائل میموری  / پرائمری میموری کیا ہے؟",
        content: "اس وقت تک ڈیٹا محفوظ جب تک بجلی ہے۔ ریم۔  جب بجلی منقطع ہوتی ہے تو ریم میں موجود ڈیٹا ضائع ہو جاتا ہے۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "29",
        question: "سٹوریج ڈیوائسسز کی تعریف اور مثال لکھیں۔ ",
        content: "یہ معلومات کو عارضی یا مستقل طور پر محفوظ کر سکتی ہیں۔  اسکی مثال ہارڈ ڈسک ، ریم، یو ایس بی ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "30",
        question: "میموری اور سٹوریج میں فرق لکھئے۔ ",
        content: "میموری میں ڈیٹا پروسسینگ کے دوران لوڈ ہوتا ہے۔ سٹوریج وہ جگہ جہاں ڈیٹا پروسینگ کے دوران لوڈ ہوتا ہے۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "31",
        question: "بٹ اور بائٹ کی تعریف کریں۔ ",
        content: "کمپیوٹر میں کم سے کم جو ڈیٹا محفوظ کیا جا سکتا ہے وہ 0 یا 1 ہے۔ اسکو بٹ کہتے ہیں، 8 بٹس کا مجموعے کو بائٹ کہتے ہیں۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "32",
        question: "بولین الجبرا کی تعریف بیان کریں۔ ",
        content: "جہاں منظقی عوامل س انجام دئے جاتے ہیں۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "33",
        question: "بولین پری پوزیشن سے کیا مراد ہے؟ ",
        content: "پری پوزیشن ایک جملہ ہے جو کہ یا تو درست ہو سکتا ہے یا غلط۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "34",
        question: "ٹروتھ ویلیوز کیا ہوتی ہیں۔ ",
        content: "پری پوزیشن درست یا غلط قدر کو ظاہر کرتی ہے۔ انہی قدروں کو ٹروتھ ویلیوز کہا جاتا ہے۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "35",
        question: "لوجیکل آپریٹرز کی وضاحت کریں۔ ",
        content: "اینڈ اپریٹر ، اور اپریٹر ، ناٹ اپریٹر ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "36",
        question: "اینڈ اپریٹر کی وضاحت کریں۔ ",
        content: "جب دو یا دو سے زیادہ پری پوزیشنز کو ملاتے ہیں تو کمپاؤنڈ پری پوزیشن اسی صورت میں ٹرو ہوگی اگر تمام منسلکہ پری پوزیشن درست ہوں۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "37",
        question: "اور اپریٹر کی وضاحت کریں۔ ",
        content: "اور اپریٹر کا استعمال کرتے ہوئے کمپاؤنڈ پری پوزیشن بنائی گئی ہے تو اسکی ٹروتھ ویلیو اسی صورت میں غلط ہو گی جب تمام پری پوزیشن غلط ہوں۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "38",
        question: "ناٹ اپریٹر کی وضاحت کریں۔ ",
        content: "یہ کسی پری پوزیشن کی ویلیو کا الٹ کرنے کے لئے استعمال ہوتا ہے۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "39",
        question: "ٹروتھ ٹیبل سے کیا مراد ہے؟ ",
        content: "کوئی پری پوزیشن درست ہے یا غلط اسکو جانچنے کے لئے ٹروتھ ٹیبل کا استعمال کیا جاتا ہے۔",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "40",
        question: "قانون مبادلہ بیان کریں۔",
        content: "بولین الجبرا میں دو یا دو سے زیادہ  پری پوزیشن کی ترتیب اہم نہیں ہوتی۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "41",
        question: "قانون تلازم  بیان کریں۔ ",
        content: "اگر ایک ایکسپریشن کے گروپس کی ترتیب بدل دی جائے تو اسکے رزلٹ پر کوئی فرق نہیں پڑتا۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "42",
        question: "ضربی اور جمعی ذاتی قانون بیان کریں۔ ",
        content: "اگر کسی ویری ایبل کو فالس کے ساتھ اور کیا جائے تو رزلٹ ہمیشہ اس  ویری ایبل کی قیمت کے برابر ہو گا۔ اگر کسی ویری ایبل کو ٹرو کیساتھ اینڈ کیا جائے تو بھی ویری ایبل کی قیمت کے برابر ہو گا۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "43",
        question: "لاجیکل ایکسپریشن سے کیا مراد ہے؟ ",
        content: "جب ہم لاجیکل اوپریٹر کو بولین پری پوزیشن پر لاگو کرتے ہیں تو یہ لاجیکل ایکسپریشن بنتی ہیں۔  اگر کسی بولین ایکسپریشن پر لاجیکل اپریٹر کا اطلاق کر دیا جائے تو ہمیں لاجیکل ایکسپریشن حاصل ہوتی ہے۔ ",
        chapter: "C2",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "44",
        question: "پے لوڈ کیا  ہوتا ہے؟ ",
        content: "پے لوڈ پیغام کے متن پر مشتمل ہوتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "45",
        question: "کنٹرول انفارمیشن سے کیا مراد ہے؟ ",
        content: "ترسیل کنندہ اور وصول کنندہ کے بارے میں معلومات کنڑول انفارمیشن میں ہوتی ہے۔ یہ پیغام کا ہیڈر بھی کہلاتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "46",
        question: "کمیونیکیشن چینل سے کیا مراد ہے؟ ",
        content: "کمیونیکیشن میڈیم بہت سارے کمپیوٹرز کو باہم جوڑتا ہے ۔ اسے کمیونیکیشن چینل بھی کہا جاتا ہے۔",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "47",
        question: "ٹی سی پی / آئی پی سے کیا مراد ہے؟",
        content: "پروٹوکول کا مجموعہ ہے جو کہ مختلف ڈیوائسسز کے درمیان اینڈ ٹو اینڈ کنکشن مہیا کرتا ہے۔ یہ پانچ لئیرز پر مشتمل ہوتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "48",
        question: "ٹرانسپورٹ لئیر کا فنکشن بیان کریں۔ ",
        content: "یہ کلائنٹ اور سرور کے درمیان تعلق کو جوڑتی ہے۔  یہ پیغام بھیجنے کی کوشش کرتی ہے۔ پیغام کے ہیڈر میں پورٹ نمبر کا اضافہ کیا جاتا ہے۔  جو کہ پیغام کی منزل کی نشاندہی کرتا ہے۔",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "49",
        question: "نیٹ ورک  لئیر کا فنکشن بیان کریں۔ ",
        content: "نیٹ ورک لئیر پر ایک پروگرام چل رہا ہوتا ہے یہ پیغام کو دوسرے نیٹ ورک پر بھیجتی ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "50",
        question: "ڈیٹا لنک   لئیر کا فنکشن بیان کریں",
        content: "یہ پیغام کو ارسال کنندہ کے ساتھ منسلک سرور پر بھیج دیتی ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "51",
        question: "فزیکل   لئیر کا فنکشن بیان کریں",
        content: "اس میڈیم کے متعلق بتاتی ہے جسکو استعمال کرتے ہوئے پیغام بھیجا یا وصول کیا جاتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "52",
        question: "ایپلی کیشن   لئیر کا فنکشن بیان کریں",
        content: "جہاں پر آپ ایک پیغام لکھتے ہیں اور نیٹ ورک پر بھیج دیتے ہیں۔ وصول کنندہ کا پتا مسیج کے ہیڈر پر دیا جاتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "53",
        question: "ایپلی کیشن لئیر پر استعمال ہونے والے پروٹوکولز کے نام",
        content: "FTP , HTTP, SMTP",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "54",
        question: "فائل ٹرانسفر پروٹوکول کیا ہوتا ہے؟ ",
        content: "ٹی سی پی / آئی پی کا ایک بنیادی  پروٹوکول ہے جو کہ فائلز کو ایک جگہ سے دوسری جگہ منتقل کرنے میں استعمال ہوتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "55",
        question: "ایچ ٹی ٹی پی سے کیا مراد ہے؟  آئی ایس پی  مخفف ہے؟ ",
        content: "ہائپر ٹیکسٹ ٹرانسفر پروٹوکول کو ورلڈ وائیڈ ویب کلائنٹ اور سرور کے درمیان ویب پیجز کی منتقلی کے لئے استعمال کیا جاتا ہے۔",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "56",
        question: "ایس ایم ٹی پی کیا ہے؟ یہ کس لئے استعمال ہوتا ہے؟ ",
        content: "سمپل میل ٹرانسفر پروٹوکول ای میل کو ایک  جگہ سے دوسری جگہ منتقل کرنے کے لئے استعمال ہوتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "57",
        question: "انٹرنیٹ  پر ایڈریسنگ کی ضرورت بیان کریں۔ ",
        content: "انٹر نیٹ پر ڈیٹا ایک جگہ سے دوسری جگہ منتقل کرنے کے لئے ایڈریس کی ضرورت ہوتی ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "58",
        question: "آئی پی ایڈریسنگ کیا ہوتا ہے؟ ",
        content: "انٹر نیٹ پروٹوکول  یہ ایک منفرد شناخت کنندہ ہے جو کہ ایک آلہ کیساتھ اس وقت منسلک کر دیا جاتا ہے جب وہ انٹرنیٹ سے رابطہ قائم کرتا ہے۔ ڈی ایچ سی پی سرور  آئی پی ایڈریس تفویض کرتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "59",
        question: "آئی پی ایڈریسنگ کے سٹینڈرڈ کے نام لکھئیے۔ ",
        content: "IPV 6 (128 Bits and 16 Bits for each group) , IPV4 (32 Bits and 8 Bits for each) ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "60",
        question: "آئی پی وی 4 اور آئی پی وی 6 میں فرق بیان کریں۔ ",
        content: "32 بائنری بٹس سے بنتا ہے جبکہ دوسرا 128  بائنری بٹس سے بنتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "61",
        question: "سٹیٹیک آئی پی ایڈریس سے کیا مراد ہے؟ ",
        content: "اگر آئی پی ایڈریس مقررہ ہو تو یہ سٹیٹک آئی پی کہلاتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "62",
        question: "ڈائنامک آئی پی ایڈریس سے کیا مراد ہے؟ ",
        content: "جب ایک آلہ انٹرنیٹ سے رابطہ قائم کرے اور اسے ایک نیا آئی پی ایڈریس تفویض ہو ۔",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "63",
        question: "رؤٹر کیا ہوتا ہے؟  انٹرنیٹ پر رؤٹنگ سے کیا مراد ہے؟ ",
        content: "ایسا عمل جس میں ایک آلے سے ڈیٹا لیکر دوسرے آلے کو مختلف نیٹ ورک پر بھیجا جا تا ہے۔ یہ بہت سارے نیٹ ورکس کو آپس میں  ملاتے ہیں۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "64",
        question: "کمپیوٹر نیٹ ورک کی تعریف بیان کریں۔ ",
        content: "جب دو یا دو سے زیادہ کمپیوٹر آپس میں نیٹ ورک بنانے کو جوڑے جائیں۔  نیٹ ورک کا نیٹ ورکس انٹرنیٹ کہلاتا ہے۔ ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "65",
        question: "نیٹ ورک ٹپالوجی سے کیا مراد ہے؟ اسکی اقسام بتائیں۔",
        content: "ایک دوسرے کے ساتھ منسلک کمپیوٹرز کے کنکشن کا جغرافیائی اظہار ۔بس ٹپالوجی ، سٹار ٹپالوجی ، رنگ ٹپالوجی ، میش ٹپالوجی ",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "66",
        question: "پروٹوکول سے کیا مراد ہے؟ ",
        content: "نیٹ ورک پروٹوکول دو کمپیوٹرز کے درمیان پیغام بھیجنے اور وصول کرنے کے لئے ایک رسمی معاہدہ کا نام ہے۔  قوانین کا مجموعہ ہوتا ہے۔",
        chapter: "C3",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "67",
        question: "پییرڈ ٹیگ اور سنگولر ٹیگ میں فرق بیان کریں۔",
        content: "یہ ٹیگز سٹارٹ ٹیگ اور اینڈ ٹیگ پر مستمل ہوتے ہیں۔ جن کے درمیان ٹیکسٹ / مواد ہوتا ہے۔  کچھ ٹیگز کے اینڈنگ ٹیگ نہیں ہوتے ہیں۔ ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "68",
        question: "ایچ ٹی ایم ایل ڈاکومنٹ میں ہیڈ سیکشن سے کیا مراد ہے؟ ",
        content: "یہ سیکشن عام طور پر ویب پیج کے ٹائٹل، سٹائل اور ڈاکومنٹ کے متعلق معلومات دیتا ہے۔ ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "69",
        question: "باڈ ی سیکشن سے کیا مراد ہے؟ ",
        content: "اس میں ویب پیج کا اصل مواد ہوتا ہے۔ جو کہ اس پیج پر جانے والا صارف دیکھ سکتا ہے۔ ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "70",
        question: "ہیڈنگ اور سب ہیڈنگ لگانا کا طریقہ بتاہیں۔ ",
        content: "ہیڈنگ کو ایچ 1 سے لیکر ایچ 6 ٹیگز کی مدد سے لکھا جاتا ہے۔  سب سے اہم ہیڈنگ کے لئے ایچ 1 ٹیگ استعمال ہوتا ہے۔ ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "71",
        question: "ایچ ٹی ایم ایل میں پیراگراف کیسے لکھ سکتے ہیں؟ ",
        content: "<p>پیراگراف بنانے کا ٹیگ     ہے۔ ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "72",
        question: "ایچ ٹی ایم ایل میں لائن بریک کیسے کر سکتے ہیں؟ ",
        content: "لائن بریک کرنے کے لئے                ٹیگ استعمال ہوتا ہے۔</br>",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "73",
        question: "وضاحتی لسٹ سے کیا مراد ہے؟ ",
        content: "<dt> <dd>یہ لسٹ اس وقت استعمال کی جاتی ہے جب ہم نے کچھ اصلاحات یا ٹرمز لکھنی ہوں۔   کا استعمال کرتے ہوئے وضاحتی لسٹ بناتےہیں اور کا استعمال کرتے ہوئے ٹرمز لکھتے ہیں۔  ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "74",
        question: "نیسٹڈ لسٹ سے کیا مراد ہے؟ ",
        content: "ایک لسٹ جو کہ اپنے اندر ایک اور لسٹ رکھ سکتی ہے۔ نیسٹڈ لسٹ کہلاتی ہے۔",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "75",
        question: "ویب پیج میں تصاویر اور بیک گراؤنڈ لگانے کا طریقہ ؟",
        content: "ویب پیج میں تصاویر کو  امیج ٹیگ کا استعمال کرتے ہوئے لگایا جاتا ہے۔",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "76",
        question: "لسٹ کی اقسام تحریر کریں۔ ",
        content: "ترتیب وار لسٹ ، بے تریب وار لسٹ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "77",
        question: "امیج میں سورس سے کیا مراد ہے؟ ",
        content: "یہ اٹری بیوٹ تصویر کا یو آر ایل بتاتی ہے۔  URL ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "78",
        question: "ہائپر لنک سے کیا مراد ہے؟ ",
        content: "یہ ایک آئیکن یا ایک تصویر ہو سکتا ہے جس پر اگر کلک کیا جائے تو اپکو کسی دوسرے پیج پر لیجاتا ہے۔ ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "79",
        question: "اینکر سے کیا مراد ہے؟ ",
        content: "اینکر اپکو ویب پیج کے کسی ایک حصے سے دوسرے حصے تک لیجاتا ہے۔ ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "80",
        question: "ایچ ٹی ایم ایل کو ہم کیسے محفوظ کرتے ہیں؟ ",
        content: "ایچ ٹی ایم ایل کو محفوظ کرنے کے لئے ہم  ایچ ٹی ایم ایل ایکسٹینشن استعمال کرتے ہیں۔  (HTML)",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "81",
        question: "ٹیبل کیسے بناتے ہیں ؟ ",
        content: "ٹیبل ٹیگ کی مدد سے۔ <table>",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "82",
        question: "ٹیبل میں ہر قطار کو کیسے بنایا جاتا ہے؟ ",
        content: "<tr>",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "83",
        question: "ٹیبل میں ہر کالم کو کیسے بنایا جاتا ہے؟",
        content: "<td>",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "84",
        question: "افقی لائن لگانے کے لئے کونسا ٹیگ استعمال ہوتا ہے؟ ",
        content: "<hr>",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "85",
        question: "ایٹری بیوٹ سے کیا مراد ہیں ؟ ",
        content: "یہ کسی بھی ٹیگ کے متعلق معلومات فراہم کرتے ہیں۔ ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "86",
        question: "ویب پیج کو کیسے بنایا جاتا ہے؟ ",
        content: "استعمال کرکے ،  Text Edit, Notepade, Notepad++",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "87",
        question: "ایچ ٹی ایم ایل عناصر کی تعداد کتنی ہے۔ ",
        content: " عناصر کی تعداد دو ہے۔  ہائپر ٹیکسٹ اور مارک اپ لینگوئج ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "88",
        question: "سپیس کے لئے کونسا ٹیگ استعمال کیا جاتا ہے؟ ",
        content: "&nbsp; ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "89",
        question: "کال سپین سے کیا مراد ہے؟ ",
        content: "ایک سیل کوایک سے زائد سیلز پر پھیلانے کے لئے ہم ٹیبل کے ایٹری بیوٹ کال سپین کا استعمال کرتے ہیں۔ ",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "90",
        question: "رو  سپین سے کیا مراد ہے؟ ",
        content: "اگر ہم ایک قطار کو ایک سے زائد قطاروں تک پھیلانا چاہتے ہوں ۔",
        chapter: "C5",
        category: "9th",
        subject: "CSC"
    },
    {
        Id: "91",
        question: "پروگرامر کی تعریف لکھیں۔ ",
        content: "ایسا شخص جو کوڈ لکھتا ہے ، کوڈ میں تبدیلی کرتا ہے اور کوڈ کو ٹیسٹ کرتا ہے۔ کمپیوٹر پراگرام بناتا ہے۔ اسے پروگرامر کہتے ہیں۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "92",
        question: "کمپیوٹر پراگرام سے کیا مراد ہے؟",
        content: "ہدایات کا مجموعہ جو مخصوص کام سر انجام دیتا ہے۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "93",
        question: "پروگرام کا مین سیکشن کیا ہے؟",
        content: "یہ کوڈ کا مین سیکشن ہے۔ یہاں سے کمپائلر کوڈ کو ایگزیکیوٹ کرتا ہے۔  یہاں ہدایات لکھی جاتی ہیں۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "94",
        question: "ہیڈر فائل سے کیا مراد ہے؟ ",
        content: "ایسی فائل  جو سی فنکشن ڈکلیریشن  پر مشتمل ہوتی ہے۔  اور سورس فائل  میں شئیر کی جاتی ہے۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "95",
        question: "لنک سیکشن سے کیا مراد ہے؟ ",
        content: "یہ کمپائلر کو سسٹم لائبریری کے ساتھ لنک کرنے کے لئیے ہدایات دیتا ہے۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "96",
        question: "سی پروگرام کی ساخت کے اہم حصے بیان کریں۔",
        content: "Documentation, Link, Definition, Global Declaration, Main Function",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "97",
        question: "چار ڈیٹا ٹائپ اور انٹ ڈیٹا  ٹائپ میں فرق بتائیں۔",
        content: "یہ کریکٹر ڈیٹا کو سٹور کرتا ہے۔ اور انٹ  نمیرک ڈیٹا کو سٹور کرتا ہے۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "98",
        question: "مین فنکشن باڈی کیا ہوتی ہے؟",
        content: "یہ مختلف سٹیمنٹس پر مشتمل ہوتی ہے اور بتاتی ہے کہ فنکشن کیا کام کرے گا۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "99",
        question: "متغیرات کیا ہوتے ہیں؟ اسکی اقسام بتائیں۔",
        content: "یہ ڈیٹا کو عارضی طور پر محفوظ کرتے ہیں۔ یہ مختلف قسم کی ویلیوز کو سٹور کرتے ہیں۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "100",
        question: "متغیرات کو ڈکلئیر کرنا اور ۔",
        content: "Int num, string name, char gender",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "101",
        question: "متغیرات کے نام رکھنے کے اصول بیان کریں۔",
        content: "حرف سے شروع ہوتے ہیں۔ نمبر سے شروع نہیں ہو سکتے۔",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "102",
        question: "آئی ڈی ای کی تعریف بیان کریں۔",
        content: "",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "103",
        question: "  متغیرات کی انشیلائزیشن کریں",
        content: "Int num = 10 , string name = “Husnain”, char  gender = ‘M’",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "104",
        question: "متغیرات کی ڈیٹا  ٹائپ سے کیا مراد ہے؟",
        content: "یہ  بتاتے ہیں کہ متغیر کس قسم کے ڈیٹا پر مشتمل ہو سکتا ہے۔ انٹ ، سٹرنگ یا کریکڑ۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "105",
        question: "پروگرامنگ میں کمنٹس کا استعمال اور اسکی اقسام؟",
        content: "پروگرام کے بارے میں لکھے جاتے ہیں۔ اسکی دو اقسام ہیں۔ سنگل لائن اور ملٹی لائن کمنٹس ۔ کمپائلر کمنٹس کو نظر انداز کر دیتا ہے۔  ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "106",
        question: "کی ورڈ سے کیا مراد ہے؟ چار کی ورڈ لکھیں۔",
        content: "یہ کمپائلر کے لئے خاص معنی رکھتے ہیں۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "107",
        question: "پروگرام فائل بنانے کے مراحل بیان کریں۔",
        content: "Click File …> New …….> Blank Project",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "108",
        question: "کمپائلر کی تعریف اور اسکے مقصد کی وضاحت کریں",
        content: "یہ ہائی لیول لینگوئج میں لکھے گئے سورس کوڈ کو مشین کوڈ میں یا دوسری لینگوئج میں تبدیل کر دیتا ہے۔  یہ ٹرانسلیٹر کا کام کرتا ہے۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "109",
        question: "ڈی بگنگ سے کیا مراد ہے؟ ",
        content: "غلطیاں تلاش کرنا اور پھر اسے دور کرنے کا عمل ڈی بگنگ کہلاتا ہے۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "110",
        question: "ٹیکسٹ ایڈیٹر سے کیا مراد ہے؟ ",
        content: "کمپیوٹر پروگرام جو ٹیکسٹ  کو ٹھیک کرتا ہے۔ ٹیکسٹ کو لکھتا ہے۔ جہاں پروگرام لکھا جاتا ہے۔ ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "111",
        question: "پروگرامنگ لینگوئج کے نام بتائیں۔",
        content: "C, C++, Java",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "112",
        question: "گرافیکل یوزر انٹر فیس سے کیا مراد ہے؟",
        content: "یوزر اسکی مدد سے گرافیکل آئکن کو استعمال کر سکتا ہے۔ یہ سکرین  پر آبجیکٹ دکھاتا ہے۔ جو ہمیں معلومات فراہم کرتے ہیں۔  ",
        chapter: "C1",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "113",
        question: "ری لیشنل ایکسپریشن سے کیا مراد ہے؟",
        content: "دو قیمتوں کے تعلق کا تعین کرنے کے لئے انکا موازانہ کرتے ہیں۔ دونوں قیمتیں برابر ہیں یا برابر نہیں ہیں۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "114",
        question: "ری لیشنل آپریٹرز کیا ہیں؟   کون کونسے ری لیشنل  آپریٹرز ہیں۔ ",
        content: "ایسا آپریٹر جو دو مقداروں کا موازانہ کرنے کیلئے استعمال ہوتا ہے۔ تمام ریلشنل آپریٹرز بائنری آپیریٹرز ہیں۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "115",
        question: "لوجیکل  آپریٹرز کیا ہیں۔ مثال دیں۔ ",
        content: "بولین ایکسپریشنز پر آپریشنز سر انجام دیتے ہیں اور جواب بھی ایک بولین ایکسپریشن ہوتا ہے۔ اینڈ ، اور ، ناٹ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "116",
        question: "یونری  آپریٹرز کیا  ہے؟ ",
        content: "یونری آپریٹرز کے لئے صرف ایک آپرینڈ درکار ہوتا ہے۔  مثال ناٹ اور سائن آپریٹر 5۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "117",
        question: "بائنری  آپریٹرز کیا ہے؟",
        content: "بائنری آپریٹرز کے لئے دو آپرینڈ درکا ر ہوتے ہیں۔ تمام ارتھمیٹک اور ریلشنل آپریٹرز۔",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "118",
        question: "آپریٹرز کی ترجیح سے کیا مراد ہے؟ کس کی ترجیح سب سے زیادہ ہے",
        content: "کون سا آپریشن پہلے انجام دینا ہے۔ مختلف آپریٹرز کی مختلف ترجیح ہوتی ہے۔ جسکی ترجیح زیادہ ہو انہیں پہلے حل کیا جاتا ہے",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "119",
        question: "فنکشنز میں کیا فرق ہے؟   Getche     اور     Getch() ",
        content: "یہ صارف سے کریکٹران پٹ لینے کے لئے استعمال ہوتا ہے۔  صارف سے ایک کریکٹر لینے کے لئے استعمال ہوتا ہے۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "120",
        question: "اسکیپ سیکوینس کیا ہیں؟  انکی ضرورت کیوں ہوتی ہے؟ ",
        content: "یہ پرنٹ ایف کو بتاتا ہے کہ معمول سے ہٹ کر  مخصوص کام کرنا ہے جو انسے منسوب کیا گیا ہے۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "121",
        question: "سی لینگوئج میں اسکیپ سیکوینس  کی وضاحت کریں۔ ",
        content: "اس میں دو کریکٹر ہوتے ہیں پہلا بیک سلیش   یعنی اسکیپ کریکٹر اور دوسرا فنکشنلیٹی کے مطابق آتا ہے۔",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "122",
        question: "اسکیپ سیکوینس کا استعمال تحریر کریں۔ ",
        content: "الرٹ کی آواز پیدا کرنا، پچھلا کریکٹر مٹانا،  افقی طور پر اگلے ٹیب سٹاپ پر بھیجنا ، اگلی لائن پر جانا ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "123",
        question: "آپریٹرز کیا ہوتے ہیں؟ ",
        content: "ڈیٹا پر عوامل سر انجام دینے والی علامت آپریٹر کہلاتی ہے۔ اسائنمنٹ آپریٹرز، ریلیشنل ، ارتھمیٹک اور منطقی آپریٹرز ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "124",
        question: "سی لینگوئج میں استعمال ہونے والے چار  آپریٹرز کے نام لکھیں۔ ",
        content: "ارتھمیٹک آپریٹرز، ری لیشنل آپریٹرز، لوجیکل آپریٹرز، با ئنری آپریٹرز",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "125",
        question: "اسائنمنٹ  آپریٹرز کی تعریف کریں۔ ",
        content: "اسائنمنٹ آپریٹر   جو ویری ایبل کو قیمت اسائن کرنے کو استعمال ہوتا ہے۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "126",
        question: "ارتھمیٹک  آپریٹرز کی تعریف کریں۔  نیز نام لکھیں۔",
        content: "ڈیٹا پر ارتھمیٹک آپریشنز انجام دینے کے لئے استعمال ہوتے ہیں۔   جمع ، تفریق ، ضرب ، ٹقسیم",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "127",
        question: "     آپریٹرز کیا ہے؟    ==  ",
        content: "  جبکہ    ریلشنل  آپریٹر ہے۔  جو چیک کرتا ہے کہ دو ایکسپریشن برابر ہیں یا نہیں۔            ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "128",
        question: "ماڈولس  آپریٹرز کا استعمال لکھئے۔ ",
        content: "ایک بائنری آپریٹرز ہے جو بائیں آپرینڈ کو دائیں آپرینڈ پر تقسیم کرتا ہے اور بچنے والی رقم جواب ہوتا ہے۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "129",
        question: "اینڈ  آپریٹرز کا استعمال تحریر کریں۔ ",
        content: "اینڈ آپریٹر دو بولین ایکسپریشنز بطور آپرینڈ لیتا ہے۔  اور جواب اسی صورت میں درست ہوتا ہے جب دونوں آپرینڈ ٹرو ہو",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "130",
        question: "اور ناٹ آپریٹرز کا استعمال تحریر کریں۔",
        content: "بولین ایکسپریشنز کی قیمت کو الٹ کر دیتا ہے۔ اگر درست ہو تو غلط اور اگر غلط ہو تو درست کر دیتا ہے۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "131",
        question: "اور آپریٹرز کا استعمال تحریر کریں۔",
        content: "بولین ایکسپریشن لیتا ہے اور اگر کوئی ایک بھی آپرینڈ درست ہو تو جواب درست ہوتا ہے۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "132",
        question: "سٹیمنٹ ٹرمینیٹر کیا ہے؟ ",
        content: "یہ کمپائلر کو بتاتا ہے کہ لائن ختم ہوگئی ہے۔ سی لینگوئج میں سیمی کولن    بطور سٹیمنٹ ٹرمینیٹر استعمال ہوتا ہے۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "133",
        question: "فارمیٹ سپیسفائرز سے کیا مراد ہے؟ کیوں ضروری ہے؟ ",
        content: "ان پٹ اور آؤٹ پٹ آپریشنز میں ڈیٹا کا فارمیٹ بتانے کے لئے استعمال ہوتا ہے۔ ٪ سائن آتا ہے۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "134",
        question: "ان پٹ آوٹ پٹ کے لئے کون سے فنکشن استعمال ہوتے ہیں۔ ",
        content: "سکین ایف صارف سے ان پٹ لینے اور پرنٹ ایف سکرین پر فارمیٹیڈ آوٹ پٹ دکھانے کو استعمال ہوتا ہے۔ ",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "135",
        question: "آپریٹرز کی ترجیح بیان کریں۔ ",
        content: "( ) ,      ! ,     * , / , %,  + , - ,  < ,   > ,   >= ,    <= ,     ==,   != ,  &&,   || , =",
        chapter: "C2",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "136",
        question: "کنٹرول سٹیمنٹس کی تعریف بیان کریں۔نیز اقسام بھی لکھیں۔  ",
        content: "جو  سٹیمنٹ پر عمل درآمد کی ترتیب کو تبدیل کرنے کے لئے استعمال ہوتی ہیں۔ کنٹرول  سٹیمنٹ کہلاتی ہیں۔ ",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "137",
        question: "سلیکشن   سٹیمنٹس  کیا ہیں ۔",
        content: "وہ  سٹیمنٹس جو شرائط کی بنا پر فیصلہ کرتی ہیں کہ آگے کونسی سٹیمنٹس چلنی چائیے۔ سلیکشن  سٹیمنٹس کہلاتی ہیں۔",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "138",
        question: "سلیکشن   سٹیمنٹس  کی اقسام کے نام لکھیں۔",
        content: "اف سٹمیمنٹ    ،    اف ایلس سٹیمنٹ",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "139",
        question: "اف  سٹیمنٹس اور ایلس  سٹیمنٹ میں فرق بیان کریں۔",
        content: "اگر شرط کا نتیجہ درست ہو گا تو اف  سٹیمنٹ چلے گی اگر شرط کا نتیجہ غلط ہوگا تو ایلس  سٹیمنٹ چلے گی۔",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "140",
        question: "کنڈیشن سے کیا مراد ہے؟",
        content: "کوئی بھی درست ایکسپریشن ہو سکتی ہے۔  جیسے ارتھمیٹک ایکسپریشنز، ریلیشنل ایکسپریشنز ، لاجیکل ایکسپریشنز یا انکا مجموعہ",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "141",
        question: "کنڈیشنل  سٹیمنٹس کی تعریف بیان کریں۔",
        content: "کنڈیشنل  سٹیمنٹس بتاتی ہیں کہ پروگرام کی  سٹیمنٹس کس ترتیب سے ایگزیکیوٹ ہوں گی۔",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "142",
        question: "سیکوئنشل کنٹرول کی تعریف بیان کریں۔",
        content: "سیکوئنشل کنٹرول  سٹرکچر میں تمام  سٹیمنٹس دی گئی ترتیب کے مطابق چلتی ہیں۔",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "143",
        question: "اف سٹیمنٹ سے کیا مراد ہے؟ ",
        content: "شرط بتا کر اس سے کوڈ منسوب کر سکتے ہیں ۔ یہ کوڈ تب چلتا ہے اگر شرط پوری ہو جائے ورنہ نہیں چلتا۔ ",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "144",
        question: "اف ایلس سٹیمنٹ سے کیا مراد ہے؟ ",
        content: "ہدایات  کا ایک سیٹ تب چلے اگر شرط پوری ہو جائے اگر شرط پوری نہ ہو تو کوئی دوسرا سیٹ  یعنی ایلس چلے۔ ",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "145",
        question: "نیسٹڈ اف کیا ہے؟",
        content: "اگر اف  سٹیمنٹ کے اندر ایک اور اف  سٹیمنٹ ہو تو یہ نیسٹڈ اف کہلاتا ہے۔",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "146",
        question: "نیسٹڈ سلیکشن  سٹرکچر کی تعریف بیان کریں۔",
        content: "اف یا ایلس بلاک کے اندر ہم مزید اف یا ایلس سٹیمنٹس لکھ سکتے ہیں۔ اور ہم یہ کام جتنی بار چاہیں کر سکتے ہیں۔  ",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "147",
        question: "بلاک / کمپاؤنڈ سٹیمنٹ سے کیا مراد ہے؟",
        content: "بریکٹ میں بند ایک سے زیادہ ہدایات کا مجموعہ بلاک  یا کمپاؤنڈ سٹیمنٹ کہلاتا ہے۔",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "148",
        question: "لوپ سے کیا مراد ہے؟ نیز اسکی اقسام بھی لکھیں۔ ",
        content: "ایک  سٹیمنٹس کو بار بار چلانا / ایگیزیکیوٹ کرنا لوپ کہلاتا ہے۔  وائل لوپ، ڈو وائل لوپ اور فار لوپ ",
        chapter: "C3",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "149",
        question: "ڈیٹا سٹرکچر کی تعریف کریں۔ ",
        content: "ڈیٹا سٹرکچر ایک کنٹینر ہوتا ہے جو ڈیٹا آئٹمز کے مجموعے کو ایک خاص ترتیب میں محفوظ کرنے کے لئے استعمال ہوتا ہے۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "150",
        question: "ارے  کی تعریف کریں۔",
        content: "ارے ایک ڈیٹا سٹرکچر ہے۔  جو ایک ہی ٹائپ کی ویلیوز کو محفوظ کر سکتی ہے۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "151",
        question: "ارے انشیلائزیشن  کی تعریف کریں۔ نیز طریقہ بیان کریں۔ ",
        content: "پہلی دفعہ ارے کے ارکان میں ویلیو محفوظ کرنے کا عمل انشیلائزیشن  کہلاتا ہے۔  ارے ارکان کی ویلیوز کو    میں لکھا جاتا ہے۔",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "152",
        question: "لوپ سٹرکچر  کی تعریف کریں۔",
        content: "ہدایات کے مجموعے کو بار بار دہرائے جانے کا عمل لوپ کہلاتا ہے۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "153",
        question: "نیسٹڈ لوپس  کی تعریف کریں۔",
        content: "لوپ کے اندرایک اور  لوپ کا استعمال نیسٹڈ لوپس کہلاتا ہے۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "154",
        question: "کیا لوپ ایک ڈیٹا سٹرکچر ہے؟ ",
        content: "نہیں۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "155",
        question: "ایک ارے کو ڈیکلیریشن کے وقت انشیلائز کرنے کا فائدہ کیا ؟ ",
        content: "ہمیں اسکی میموری کے سائز کا اندازہ ہو جاتا ہے۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "156",
        question: "ارے ڈییکلیریشن کیا ہے نیز ارے کو کیسے ڈکلیر کر سکتے ہیں؟ ",
        content: "ارے کی ڈیٹا ٹائپ ، نام  اور ارے کے سائز ظاہر کرنے کاعمل ڈیکلیریشن کہلاتا ہے۔  ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "157",
        question: "ارے ویلیوز کو کس طرح میموری میں محفوظ کرتی ہیں؟ ",
        content: "ارے کے ایلیمنٹس میموری کے منسلک مقامات پرمحفوظ ہوتی ہیں۔    ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "158",
        question: "ارے کے ارکان تک رسائی کیسے حاصل کی جاتی ہے؟ ",
        content: "ارے کے ارکان تک رسائی حاصل کرنے  کے لئے اس رکن کا انڈکس نمبر استعمال کیا جاتا ہے۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "159",
        question: "لوپ باڈی سے کیا مراد ہے؟ ",
        content: "اس میں کوڈ لکھا ہوتا ہے جو بار بار رپیٹ ہونا ہوتا ہے۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "160",
        question: "کنڈیشن کے بعد لوپ کا کون سا حصہ ایگزیکیوٹ ہوتا ہے؟ ",
        content: " اگر کنڈیشن درست ہو تو لوپ کی باڈی چلتی ہے۔  اسکے بعد کاؤنٹر ویری ایبل میں لاجک کیمطابق اضافہ یا کمی ہوتی ہے۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "161",
        question: "اگر لوپ میں موجود کنڈیشن پہلی مرتبہ ہی غلط ہو تو کیا ہو گا؟ ",
        content: "پروگرام لوپ سے باہر آجائے گا۔",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "162",
        question: "فار لوپ کا سنٹیکس لکھئے۔ ",
        content: "for  (int i = 0; i < 5; i ++ )",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "163",
        question: "فار لوپ کے انشیلائزیشن حصہ کی وضاحت کریں۔ ",
        content: "یہ سب سے پہلے ایگزیکیوٹ ہوتا ہے ۔اس میں ہم کاؤنٹر ویری ایبل کو انشیلائز کرتے ہیں ۔  یہ لوپ کا سٹارٹنگ پوائنٹ ہے۔",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "164",
        question: "فار لوپ کے کنڈیشن حصہ کی وضاحت کریں۔ ",
        content: "کنڈیشن چیک ہوتی ہے۔ اگر یہ غلط ہو تو ہم لوپ سے باہر آجاتے ہیں۔  ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "165",
        question: "فار لوپ میں انکریمنٹ / ڈیکریمنٹ کیوں استعمال کیا جاتا ہے؟",
        content: "انکریمنٹ کا استعمال ویلیو میں اضافہ کرنے کے لئے جبکہ ڈیکریمنٹ کا استعمال ویلیو میں کمی کرنے کے لئے کیا جاتا ہے۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "166",
        question: "لوپس کو استعمال کرنے کے دو مقاصد بیان کریں۔",
        content: "لوپس کے ذریعے اریز میں قیمتیں لکھنا آسان ہوجاتا ہے۔  لوپس کے ذریعے اریز میں قیمتیں پڑھناآسان ہوجاتا ہے۔",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "167",
        question: "ارے کو کیسے ڈکلئیر کیا جاتا ہے؟ ",
        content: "     سے [ ] ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "168",
        question: "انشیلائزکرتے وقت  ارے کے ارکان کی ویلیوز کو لکھا جاتا ہے؟",
        content: "سے   {}",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "169",
        question: "انشیلائزکرتے وقت  ارے کے ارکان کی ویلیوز کو علیحدہ کرتے ہے؟",
        content: "کوما سے",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "170",
        question: "ارے کے ایلیمنٹس کہاں محفوظ ہوتے ہیں؟ ",
        content: "ارے کے ایلیمنٹس میمور ی کے مقامات  منسلک پر محفوظ  ہوتے ہیں۔ ",
        chapter: "C4",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "171",
        question: "فنکشنز کی تعریف کریں ۔ ",
        content: "فنکشن سٹیمنٹس کا ایک بلاک ہے جو کہ ایک خاص کام انجام دیتا ہے۔ صارف کے مطلوب افعال پروگرام کو سرانجام دیتا",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "172",
        question: "بلٹ ان فنکشنز کی تعریف کریں۔ ",
        content: "وہ  فنکشن جو سی کی سٹینڈرڈ لائبریری میں موجود ہیں۔ بلٹ ان  فنکشن کہلاتے ہیں۔",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "173",
        question: "یوزر ڈیفائنڈ  فنکشنز کی تعریف کریں۔",
        content: "وہ  فنکشنز جو پروگرامر ڈیفائن کرتا ہے یوزر ڈیفائن فنکشنز کہلاتے ہیں۔  یہ یوزر خود بناتا ہے۔ ",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "174",
        question: "فنکشن پیرا میٹرز کی تعریف کریں۔ ",
        content: "فنکشن کچھ ان پٹ لیتا ہے۔  فنکشن کی ان پٹس کو پیرامیٹرز کہتے ہیں۔ ایک فنکشن کے ایک سے زیادہ پیرامیٹرز ہو سکتے ہیں۔ اسے کوما سے علیحدہ کیا جاتا ہے۔  یہ فنکشن ہیڈر میں استعمال ہونے والے متغیرات ہوتے ہیں۔ ",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "175",
        question: "ریٹرن وہلیو سے کیا مراد ہے؟ ",
        content: "اور آوٹ پٹ کو ریٹرن ویلیو کہتے ہیں۔ فنکشن ایک ہی قیمت ریٹرن کر سکتا ہےزیادہ نہیں۔ ",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "176",
        question: "فنکشن سگنیچر کی تعریف کریں۔",
        content: "فنکشن  کا نام ، ریٹرن ٹائپ  اور پیرامیٹرز واضح کرنے کا عمل فنکشن  سگنیچر کہلا تا ہے یہ فنکشن پروٹو ٹائپ بھی کہلاتا ہے۔",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "177",
        question: "فنکشن کے فوائد بیان کریں۔ ",
        content: "دوبارہ استعمال کرنا ،  کاموں کو الگ کرنا ،  مسئلے کی پچیدگی سے نمٹنا ،   پڑھنے کی صلاحیت ",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "178",
        question: "فنکشن کی اقسام بیان کریں۔",
        content: "بلٹ ان فنکشن  ،          یوزر ڈیفائنڈ  فنکشن",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "179",
        question: "فنکشن کو ڈیفائن کرنا سے کیا مراد ہے؟ ",
        content: "ایک فنکشن کے سگنیچر سے یہ پتا نہیں چلتا کہ وہ کس کام کے لئے ہے۔ اس کےلئے فنکشن ڈیفینیشن ہوتی ہے۔",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "180",
        question: "فنکشن کی باڈی سے کیا مراد ہے؟ ",
        content: "فنکشن کی باڈی ان سٹیٹمنٹس کا سیٹ ہوتا ہے جنہیں چلا کر فنکشن کوئی خاص کام سر انجام دیتا ہے۔  فنکشن سگنیچر کے فورا بعد  قوسین میں لکھی گئی سٹیٹمنٹس  فنکشن کی باڈی بناتی ہے۔ ",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "181",
        question: "فنکشن کے اندر ریٹرن سے کیا مراد ہے؟ ",
        content: "فنکشن کے اند ر ریٹرن ایک مطلوبہ لفظ ہے جو کالنگ فنکشن کی قیمت کو ریٹرن کرنے کے لئے استعمال ہوتا ہے۔  ایک فنکشن ایک سے زیادہ قیمتیں ریٹرن نہیں کر سکتا۔ ورنہ کمپائلر ایرر دیتا ہے۔ ایک فنکشن میں ایک سے زیادہ ریٹرن سٹیٹمنٹس ہو سکتی ہیں ",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "182",
        question: "فنکشن کا استعمال کیسے کیا جاتا ہے؟ ",
        content: "ہمیں ایک فنکشن کو کال کرنا پڑتا ہے تاکہ وہ پروگرام کو سونپا گیا کام انجام دے۔ فنکشن کال کے لئے یہ ڈھانچہ  ہے۔ ",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "183",
        question: "فنکشن کو کال کرنے سے کیا مراد ہے؟",
        content: "جب کوئی فنکشن کال آتی ہے تو کنٹرول اس فنکشنز کو ٹرانسفر ہوجاتا ہے۔ کال کئے گئے فنکشن کے ایگزیکیوٹ ہونے کے بعد کنڑول واپس اس فنکشن کے پاس چلا جاتا ہے جس نے فنکشن کال کیا ہوتا ہے۔",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "184",
        question: "فنکشن کی کال کب ختم ہوتی ہے؟",
        content: "جیسے ہی ایک ریٹرن سٹیٹمنٹ چلتی ہے فنکشن کی کال ختم ہوجاتی ہے فنکشن کی باڈی کی باقی سٹیٹمنٹس نہیں چلتی۔",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "185",
        question: "ریٹرن ٹائپ سے کیا مراد ہے؟ ",
        content: "فنکشن کے نام سے پہلے جو ڈیٹا ٹائپ ظاہر کی جاتی ہے اسے ریٹرن ٹائپ کہا جاتا ہے۔ ",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    },
    {
        Id: "186",
        question: "آرگیومنٹس کیا ہوتے ہیں؟",
        content: "فنکشن کو پاس کی گئی قیمتیں آرگیومنٹس کہلاتی ہیں۔ آرگیومنٹس اور پیرامیٹرز کی ٹائپ ایک جیسی ہونی چاہیے۔",
        chapter: "C5",
        category: "10th",
        subject: "CSC"
    }
]

export default csc