export const notes = [
    {
        Id: "1",
        question: "مسئلہ سے کیا مراد ہے؟",
        content: "نا پسندیدہ عمل جسکو درست کرنے کی ضرورت ہوتی ہے۔ ",
        
        
        
    },
    {
        Id: "2",
        question: "مسئلہ  حل کرنے کے مراحل کے نام بتائیں۔",
        content: "مسئلہ کا تعین، مسئلے کو سمجھنا ، حل کی منصوبہ بندی، کینڈڈ سلوشن ",
        
        
        
    },
    {
        Id: "3",
        question: "مسئلہ کے تعین سے کیا مراد ہے؟",
        content: "تمام بنیادی باتیں واضح طور پر متعین کی گئی ہوں، یہ واضح منزل رکھتا ہے۔ ",
        
        
        
    },
    {
        Id: "4",
        question: "تقسیم کریں اور فتح حاصل کریں کی حکمت عملی بتائیں۔",
        content: "یہ حکمت عملی پچیدہ مسئلے کو چھوٹے مسئلوں میں تقسیم کرتی ہے۔ ",
        
        
        
    },
    {
        Id: "5",
        question: "ایکٹ اٹ آوٹ سے کیا مراد ہے؟",
        content: "ڈیزانر کاموں کی فہرست تیار کرتا ہے۔ اور ہر کام کو سر انجام دیتا ہے۔ ",
        
        
        
    },
    {
        Id: "6",
        question: "\"ٹیکنیک \"\" نمونہ \"\" سے کیا مراد ہے؟ \"",
        content: "یہ مسئلے کا آخری حل نہیں ہے تاہم ڈیزانر کی مدد کر سکتا ہے۔ ",
        
        
        
    },
    {
        Id: "7",
        question: "کینڈڈ سلوشن سے کیا مراد ہے؟ ",
        content: "غیر منصوبہ بندی کا حوالہ دیتا ہے۔ ",
        
        
        
    },
    {
        Id: "8",
        question: "ٹیسٹ ڈیٹا سے کیا مراد ہے؟ ",
        content: "مسئلے کو حل کرنے کے بعد اسکو ٹیسٹ کیا جاتا ہے کہ حل درست ہے یا نہیں۔ ",
        
        
        
    },
    {
        Id: "9",
        question: "درست ٹیست ڈیٹا اور نا درست ٹیسٹ ڈیٹا میں فرق",
        content: "دی گئی ان پٹ الگورتھم کے تقاضوں کے عین مطابق ہوتی ہے۔  نا درست ڈیٹا الگورتھم کے تقاضوں سے ہم آہنگی نہیں رکھتا۔  ",
        
        
        
    },
    {
        Id: "10",
        question: "باؤنڈری ٹیسٹ ڈیٹا  سے کیا مراد ہے؟",
        content: "حل کو انتہائی اقدار کے لئے ٹیسٹ کیا جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "11",
        question: "ڈیٹا کا غلط نمونہ ٹیسٹ ڈیٹا سے کیا مراد ہے؟",
        content: "الگورتھم کو غلط نمونہ کے لئے ٹیسٹ کیا جا ئے۔ ",
        
        
        
    },
    {
        Id: "12",
        question: "عدم دستیاب ڈیٹا کیا ہوتا ہے؟ ",
        content: "الگورتھم کو اسکی ضرورت سے کم ان پٹ دیکر ٹیسٹ کیا جائے۔ ",
        
        
        
    },
    {
        Id: "13",
        question: "ٹریس ٹیبل سے کیا مراد ہے؟",
        content: "الگورتھم کے جائزے کو ٹیسٹ کرنے کے لئے اسے استعمال کیا جاتا ہے۔  اس میں ڈیٹا کو کالم اور ویلیو کو قطار سے ظاہر کیا جاتا ہے۔",
        
        
        
    },
    {
        Id: "14",
        question: "\"ٹریس ٹیبل میں \"\"خالی \"\" اور \"\" - - \"\" سے کیا مراد ہے؟\"",
        content: "\"\"\"خالی\"\" سے مراد کوئی تبدیلی نہیں اور \"\" - - \"\" سے مراد ویلیو کا کوئی تعلق نہیں۔ \"",
        
        
        
    },
    {
        Id: "15",
        question: "لوجیکل ایرر سے کیا مراد ہے؟ ",
        content: "ایسا ایرر جو منطق کے خلاف ہو جیسے 5 کو 0 سے تقسیم کرنا۔ ",
        
        
        
    },
    {
        Id: "16",
        question: "ویری فیکیشن اور ویلیڈیشن میں فرق بیان کریں۔",
        content: "ویری فیکیشن سے مراد حل درست رزلٹ دے رہا ہے یا نہیں اور ویلیڈیشن سے مراد خاص مسئلے کی نوعیت  عین مطابق ہیں۔",
        
        
        
    },
    {
        Id: "17",
        question: "الگورتھم اور فلو چارٹ میں فرق بیان کریں۔",
        content: "الگورتھم مسئلہ حل کرنے کے مراحل کے مجموعے کا نام ہے۔ الگورتھم کا تصویری اظہار فلو چارٹ کہلاتا ہے۔ ",
        
        
        
    },
    {
        Id: "18",
        question: "فلو چارٹ کی علامات بیان کریں۔",
        content: "فلو لائن، ٹرمینل ، عمل، فیصلہ سازی، ان پٹ/ آوٹ پٹ ، کنیکٹر ",
        
        
        
    },
    {
        Id: "19",
        question: "فلو چارٹ میں ان پٹ اور آوٹ پٹ میں فرق بیان کریں",
        content: "ان پٹ سے مراد صارف سے ڈیٹا لینا ہے اور آوٹ پٹ معلومات کو ظاہر کرنے کے لئے استعمال کیا جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "20",
        question: "فلوچارٹ کے فائدے اور نقصانات بیان کریں۔",
        content: "فلو چارٹ بنانا آسان ہے۔ مسئلہ کو حل کرنے میں آسانی ہوتی ہے۔ اسمیں ترمیم آسان نہیں ہوتی۔ زیادہ وقت درکار ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "21",
        question: "الگورتھم کے  فائدے اور نقصانات بیان کریں۔",
        content: "الگوتھم آسانی سے لکھا جا سکتا ہے۔ تکنیک سمجھنا آسان ہے۔۔ الگورتھم میں بہاو دیکھانا ممکن نہ ہے۔ ",
        
        
        
    },
    {
        Id: "22",
        question: "نمبر سسٹم سے کیا مراد ہے؟ ",
        content: "عددی نظام اعداد و شمار کی نمائندگی کے لئے ایک سسٹم استعمال کرتا ہے۔ جسے نمبر سسٹم کہتے ہیں۔ ",
        
        
        
    },
    {
        Id: "23",
        question: "نمبر سسٹم کی اقسام کے نام لکھیں۔ ",
        content: "اعشاری عددی نظام  ،  بائنری نمبر سسٹم ،   ہیگزا ڈیسمل نمبر سسٹم   ",
        
        
        
    },
    {
        Id: "24",
        question: "اعشاری نطام سے کیا مراد ہے؟ ",
        content: "اعشاری عددی نظام کی بنیاد 10 ہے۔ یہ 0 سے لیکر 9 عدد پر مشتمل ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "25",
        question: "ثنائی عددی نظام کیا ہے؟ ",
        content: "ثنائی عددی نظام کی بنیاد  2 ہے۔ یہ 0، 1 ہندسے پر مشتمل ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "26",
        question: "آسکی کوڈ کیا ہے؟ ",
        content: "یہ کمپیوٹر میموری میں ڈیٹا کی نمائندگی کے لئے ایک ڈی-فیکٹو سٹینڈرڈ ہے۔ کمپیوٹر  ڈیٹا بائنری شکل میں محفوظ کرتا ہے۔ ",
        
        
        
    },
    {
        Id: "27",
        question: "میموری سے کیا مراد ہے؟ اسکی اقسام بتائیں۔ ",
        content: "ایسا مادی آلہ جو ڈیٹا کو محفوظ کرنے کے قابل ہوتا ہے، اسکی دو اقسام ہیں۔ ریم اور روم ",
        
        
        
    },
    {
        Id: "28",
        question: "وولاٹائل میموری  / پرائمری میموری کیا ہے؟",
        content: "اس وقت تک ڈیٹا محفوظ جب تک بجلی ہے۔ ریم۔  جب بجلی منقطع ہوتی ہے تو ریم میں موجود ڈیٹا ضائع ہو جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "29",
        question: "سٹوریج ڈیوائسسز کی تعریف اور مثال لکھیں۔ ",
        content: "یہ معلومات کو عارضی یا مستقل طور پر محفوظ کر سکتی ہیں۔  اسکی مثال ہارڈ ڈسک ، ریم، یو ایس بی ",
        
        
        
    },
    {
        Id: "30",
        question: "میموری اور سٹوریج میں فرق لکھئے۔ ",
        content: "میموری میں ڈیٹا پروسسینگ کے دوران لوڈ ہوتا ہے۔ سٹوریج وہ جگہ جہاں ڈیٹا پروسینگ کے دوران لوڈ ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "31",
        question: "بٹ اور بائٹ کی تعریف کریں۔ ",
        content: "کمپیوٹر میں کم سے کم جو ڈیٹا محفوظ کیا جا سکتا ہے وہ 0 یا 1 ہے۔ اسکو بٹ کہتے ہیں، 8 بٹس کا مجموعے کو بائٹ کہتے ہیں۔ ",
        
        
        
    },
    {
        Id: "32",
        question: "بولین الجبرا کی تعریف بیان کریں۔ ",
        content: "جہاں منظقی عوامل س انجام دئے جاتے ہیں۔ ",
        
        
        
    },
    {
        Id: "33",
        question: "بولین پری پوزیشن سے کیا مراد ہے؟ ",
        content: "پری پوزیشن ایک جملہ ہے جو کہ یا تو درست ہو سکتا ہے یا غلط۔ ",
        
        
        
    },
    {
        Id: "34",
        question: "ٹروتھ ویلیوز کیا ہوتی ہیں۔ ",
        content: "پری پوزیشن درست یا غلط قدر کو ظاہر کرتی ہے۔ انہی قدروں کو ٹروتھ ویلیوز کہا جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "35",
        question: "لوجیکل آپریٹرز کی وضاحت کریں۔ ",
        content: "اینڈ اپریٹر ، اور اپریٹر ، ناٹ اپریٹر ",
        
        
        
    },
    {
        Id: "36",
        question: "اینڈ اپریٹر کی وضاحت کریں۔ ",
        content: "جب دو یا دو سے زیادہ پری پوزیشنز کو ملاتے ہیں تو کمپاؤنڈ پری پوزیشن اسی صورت میں ٹرو ہوگی اگر تمام منسلکہ پری پوزیشن درست ہوں۔ ",
        
        
        
    },
    {
        Id: "37",
        question: "اور اپریٹر کی وضاحت کریں۔ ",
        content: "اور اپریٹر کا استعمال کرتے ہوئے کمپاؤنڈ پری پوزیشن بنائی گئی ہے تو اسکی ٹروتھ ویلیو اسی صورت میں غلط ہو گی جب تمام پری پوزیشن غلط ہوں۔ ",
        
        
        
    },
    {
        Id: "38",
        question: "ناٹ اپریٹر کی وضاحت کریں۔ ",
        content: "یہ کسی پری پوزیشن کی ویلیو کا الٹ کرنے کے لئے استعمال ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "39",
        question: "ٹروتھ ٹیبل سے کیا مراد ہے؟ ",
        content: "کوئی پری پوزیشن درست ہے یا غلط اسکو جانچنے کے لئے ٹروتھ ٹیبل کا استعمال کیا جاتا ہے۔",
        
        
        
    },
    {
        Id: "40",
        question: "قانون مبادلہ بیان کریں۔",
        content: "بولین الجبرا میں دو یا دو سے زیادہ  پری پوزیشن کی ترتیب اہم نہیں ہوتی۔ ",
        
        
        
    },
    {
        Id: "41",
        question: "قانون تلازم  بیان کریں۔ ",
        content: "اگر ایک ایکسپریشن کے گروپس کی ترتیب بدل دی جائے تو اسکے رزلٹ پر کوئی فرق نہیں پڑتا۔ ",
        
        
        
    },
    {
        Id: "42",
        question: "ضربی اور جمعی ذاتی قانون بیان کریں۔ ",
        content: "اگر کسی ویری ایبل کو فالس کے ساتھ اور کیا جائے تو رزلٹ ہمیشہ اس  ویری ایبل کی قیمت کے برابر ہو گا۔ اگر کسی ویری ایبل کو ٹرو کیساتھ اینڈ کیا جائے تو بھی ویری ایبل کی قیمت کے برابر ہو گا۔ ",
        
        
        
    },
    {
        Id: "43",
        question: "لاجیکل ایکسپریشن سے کیا مراد ہے؟ ",
        content: "جب ہم لاجیکل اوپریٹر کو بولین پری پوزیشن پر لاگو کرتے ہیں تو یہ لاجیکل ایکسپریشن بنتی ہیں۔  اگر کسی بولین ایکسپریشن پر لاجیکل اپریٹر کا اطلاق کر دیا جائے تو ہمیں لاجیکل ایکسپریشن حاصل ہوتی ہے۔ ",
        
        
        
    },
    {
        Id: "44",
        question: "پے لوڈ کیا  ہوتا ہے؟ ",
        content: "پے لوڈ پیغام کے متن پر مشتمل ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "45",
        question: "کنٹرول انفارمیشن سے کیا مراد ہے؟ ",
        content: "ترسیل کنندہ اور وصول کنندہ کے بارے میں معلومات کنڑول انفارمیشن میں ہوتی ہے۔ یہ پیغام کا ہیڈر بھی کہلاتا ہے۔ ",
        
        
        
    },
    {
        Id: "46",
        question: "کمیونیکیشن چینل سے کیا مراد ہے؟ ",
        content: "کمیونیکیشن میڈیم بہت سارے کمپیوٹرز کو باہم جوڑتا ہے ۔ اسے کمیونیکیشن چینل بھی کہا جاتا ہے۔",
        
        
        
    },
    {
        Id: "47",
        question: "ٹی سی پی / آئی پی سے کیا مراد ہے؟",
        content: "پروٹوکول کا مجموعہ ہے جو کہ مختلف ڈیوائسسز کے درمیان اینڈ ٹو اینڈ کنکشن مہیا کرتا ہے۔ یہ پانچ لئیرز پر مشتمل ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "48",
        question: "ٹرانسپورٹ لئیر کا فنکشن بیان کریں۔ ",
        content: "یہ کلائنٹ اور سرور کے درمیان تعلق کو جوڑتی ہے۔  یہ پیغام بھیجنے کی کوشش کرتی ہے۔ پیغام کے ہیڈر میں پورٹ نمبر کا اضافہ کیا جاتا ہے۔  جو کہ پیغام کی منزل کی نشاندہی کرتا ہے۔",
        
        
        
    },
    {
        Id: "49",
        question: "نیٹ ورک  لئیر کا فنکشن بیان کریں۔ ",
        content: "نیٹ ورک لئیر پر ایک پروگرام چل رہا ہوتا ہے یہ پیغام کو دوسرے نیٹ ورک پر بھیجتی ہے۔ ",
        
        
        
    },
    {
        Id: "50",
        question: "ڈیٹا لنک   لئیر کا فنکشن بیان کریں",
        content: "یہ پیغام کو ارسال کنندہ کے ساتھ منسلک سرور پر بھیج دیتی ہے۔ ",
        
        
        
    },
    {
        Id: "51",
        question: "فزیکل   لئیر کا فنکشن بیان کریں",
        content: "اس میڈیم کے متعلق بتاتی ہے جسکو استعمال کرتے ہوئے پیغام بھیجا یا وصول کیا جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "52",
        question: "ایپلی کیشن   لئیر کا فنکشن بیان کریں",
        content: "جہاں پر آپ ایک پیغام لکھتے ہیں اور نیٹ ورک پر بھیج دیتے ہیں۔ وصول کنندہ کا پتا مسیج کے ہیڈر پر دیا جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "53",
        question: "ایپلی کیشن لئیر پر استعمال ہونے والے پروٹوکولز کے نام",
        content: "FTP , HTTP, SMTP",
        
        
        
    },
    {
        Id: "54",
        question: "فائل ٹرانسفر پروٹوکول کیا ہوتا ہے؟ ",
        content: "ٹی سی پی / آئی پی کا ایک بنیادی  پروٹوکول ہے جو کہ فائلز کو ایک جگہ سے دوسری جگہ منتقل کرنے میں استعمال ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "55",
        question: "ایچ ٹی ٹی پی سے کیا مراد ہے؟  آئی ایس پی  مخفف ہے؟ ",
        content: "ہائپر ٹیکسٹ ٹرانسفر پروٹوکول کو ورلڈ وائیڈ ویب کلائنٹ اور سرور کے درمیان ویب پیجز کی منتقلی کے لئے استعمال کیا جاتا ہے۔",
        
        
        
    },
    {
        Id: "56",
        question: "ایس ایم ٹی پی کیا ہے؟ یہ کس لئے استعمال ہوتا ہے؟ ",
        content: "سمپل میل ٹرانسفر پروٹوکول ای میل کو ایک  جگہ سے دوسری جگہ منتقل کرنے کے لئے استعمال ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "57",
        question: "انٹرنیٹ  پر ایڈریسنگ کی ضرورت بیان کریں۔ ",
        content: "انٹر نیٹ پر ڈیٹا ایک جگہ سے دوسری جگہ منتقل کرنے کے لئے ایڈریس کی ضرورت ہوتی ہے۔ ",
        
        
        
    },
    {
        Id: "58",
        question: "آئی پی ایڈریسنگ کیا ہوتا ہے؟ ",
        content: "انٹر نیٹ پروٹوکول  یہ ایک منفرد شناخت کنندہ ہے جو کہ ایک آلہ کیساتھ اس وقت منسلک کر دیا جاتا ہے جب وہ انٹرنیٹ سے رابطہ قائم کرتا ہے۔ ڈی ایچ سی پی سرور  آئی پی ایڈریس تفویض کرتا ہے۔ ",
        
        
        
    },
    {
        Id: "59",
        question: "آئی پی ایڈریسنگ کے سٹینڈرڈ کے نام لکھئیے۔ ",
        content: "IPV 6 (128 Bits and 16 Bits for each group) , IPV4 (32 Bits and 8 Bits for each) ",
        
        
        
    },
    {
        Id: "60",
        question: "آئی پی وی 4 اور آئی پی وی 6 میں فرق بیان کریں۔ ",
        content: "32 بائنری بٹس سے بنتا ہے جبکہ دوسرا 128  بائنری بٹس سے بنتا ہے۔ ",
        
        
        
    },
    {
        Id: "61",
        question: "سٹیٹیک آئی پی ایڈریس سے کیا مراد ہے؟ ",
        content: "اگر آئی پی ایڈریس مقررہ ہو تو یہ سٹیٹک آئی پی کہلاتا ہے۔ ",
        
        
        
    },
    {
        Id: "62",
        question: "ڈائنامک آئی پی ایڈریس سے کیا مراد ہے؟ ",
        content: "جب ایک آلہ انٹرنیٹ سے رابطہ قائم کرے اور اسے ایک نیا آئی پی ایڈریس تفویض ہو ۔",
        
        
        
    },
    {
        Id: "63",
        question: "رؤٹر کیا ہوتا ہے؟  انٹرنیٹ پر رؤٹنگ سے کیا مراد ہے؟ ",
        content: "ایسا عمل جس میں ایک آلے سے ڈیٹا لیکر دوسرے آلے کو مختلف نیٹ ورک پر بھیجا جا تا ہے۔ یہ بہت سارے نیٹ ورکس کو آپس میں  ملاتے ہیں۔ ",
        
        
        
    },
    {
        Id: "64",
        question: "کمپیوٹر نیٹ ورک کی تعریف بیان کریں۔ ",
        content: "جب دو یا دو سے زیادہ کمپیوٹر آپس میں نیٹ ورک بنانے کو جوڑے جائیں۔  نیٹ ورک کا نیٹ ورکس انٹرنیٹ کہلاتا ہے۔ ",
        
        
        
    },
    {
        Id: "65",
        question: "نیٹ ورک ٹپالوجی سے کیا مراد ہے؟ اسکی اقسام بتائیں۔",
        content: "ایک دوسرے کے ساتھ منسلک کمپیوٹرز کے کنکشن کا جغرافیائی اظہار ۔بس ٹپالوجی ، سٹار ٹپالوجی ، رنگ ٹپالوجی ، میش ٹپالوجی ",
        
        
        
    },
    {
        Id: "66",
        question: "پروٹوکول سے کیا مراد ہے؟ ",
        content: "نیٹ ورک پروٹوکول دو کمپیوٹرز کے درمیان پیغام بھیجنے اور وصول کرنے کے لئے ایک رسمی معاہدہ کا نام ہے۔  قوانین کا مجموعہ ہوتا ہے۔",
        
        
        
    },
    {
        Id: "67",
        question: "پییرڈ ٹیگ اور سنگولر ٹیگ میں فرق بیان کریں۔",
        content: "یہ ٹیگز سٹارٹ ٹیگ اور اینڈ ٹیگ پر مستمل ہوتے ہیں۔ جن کے درمیان ٹیکسٹ / مواد ہوتا ہے۔  کچھ ٹیگز کے اینڈنگ ٹیگ نہیں ہوتے ہیں۔ ",
        
        
        
    },
    {
        Id: "68",
        question: "ایچ ٹی ایم ایل ڈاکومنٹ میں ہیڈ سیکشن سے کیا مراد ہے؟ ",
        content: "یہ سیکشن عام طور پر ویب پیج کے ٹائٹل، سٹائل اور ڈاکومنٹ کے متعلق معلومات دیتا ہے۔ ",
        
        
        
    },
    {
        Id: "69",
        question: "باڈ ی سیکشن سے کیا مراد ہے؟ ",
        content: "اس میں ویب پیج کا اصل مواد ہوتا ہے۔ جو کہ اس پیج پر جانے والا صارف دیکھ سکتا ہے۔ ",
        
        
        
    },
    {
        Id: "70",
        question: "ہیڈنگ اور سب ہیڈنگ لگانا کا طریقہ بتاہیں۔ ",
        content: "ہیڈنگ کو ایچ 1 سے لیکر ایچ 6 ٹیگز کی مدد سے لکھا جاتا ہے۔  سب سے اہم ہیڈنگ کے لئے ایچ 1 ٹیگ استعمال ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "71",
        question: "ایچ ٹی ایم ایل میں پیراگراف کیسے لکھ سکتے ہیں؟ ",
        content: "<p>پیراگراف بنانے کا ٹیگ     ہے۔ ",
        
        
        
    },
    {
        Id: "72",
        question: "ایچ ٹی ایم ایل میں لائن بریک کیسے کر سکتے ہیں؟ ",
        content: "لائن بریک کرنے کے لئے                ٹیگ استعمال ہوتا ہے۔</br>",
        
        
        
    },
    {
        Id: "73",
        question: "وضاحتی لسٹ سے کیا مراد ہے؟ ",
        content: "<dt> <dd>یہ لسٹ اس وقت استعمال کی جاتی ہے جب ہم نے کچھ اصلاحات یا ٹرمز لکھنی ہوں۔   کا استعمال کرتے ہوئے وضاحتی لسٹ بناتےہیں اور کا استعمال کرتے ہوئے ٹرمز لکھتے ہیں۔  ",
        
        
        
    },
    {
        Id: "74",
        question: "نیسٹڈ لسٹ سے کیا مراد ہے؟ ",
        content: "ایک لسٹ جو کہ اپنے اندر ایک اور لسٹ رکھ سکتی ہے۔ نیسٹڈ لسٹ کہلاتی ہے۔",
        
        
        
    },
    {
        Id: "75",
        question: "ویب پیج میں تصاویر اور بیک گراؤنڈ لگانے کا طریقہ ؟",
        content: "ویب پیج میں تصاویر کو  امیج ٹیگ کا استعمال کرتے ہوئے لگایا جاتا ہے۔",
        
        
        
    },
    {
        Id: "76",
        question: "لسٹ کی اقسام تحریر کریں۔ ",
        content: "ترتیب وار لسٹ ، بے تریب وار لسٹ",
        
        
        
    },
    {
        Id: "77",
        question: "امیج میں سورس سے کیا مراد ہے؟ ",
        content: "یہ اٹری بیوٹ تصویر کا یو آر ایل بتاتی ہے۔  URL ",
        
        
        
    },
    {
        Id: "78",
        question: "ہائپر لنک سے کیا مراد ہے؟ ",
        content: "یہ ایک آئیکن یا ایک تصویر ہو سکتا ہے جس پر اگر کلک کیا جائے تو اپکو کسی دوسرے پیج پر لیجاتا ہے۔ ",
        
        
        
    },
    {
        Id: "79",
        question: "اینکر سے کیا مراد ہے؟ ",
        content: "اینکر اپکو ویب پیج کے کسی ایک حصے سے دوسرے حصے تک لیجاتا ہے۔ ",
        
        
        
    },
    {
        Id: "80",
        question: "ایچ ٹی ایم ایل کو ہم کیسے محفوظ کرتے ہیں؟ ",
        content: "ایچ ٹی ایم ایل کو محفوظ کرنے کے لئے ہم  ایچ ٹی ایم ایل ایکسٹینشن استعمال کرتے ہیں۔  (HTML)",
        
        
        
    },
    {
        Id: "81",
        question: "ٹیبل کیسے بناتے ہیں ؟ ",
        content: "ٹیبل ٹیگ کی مدد سے۔ <table>",
        
        
        
    },
    {
        Id: "82",
        question: "ٹیبل میں ہر قطار کو کیسے بنایا جاتا ہے؟ ",
        content: "<tr>",
        
        
        
    },
    {
        Id: "83",
        question: "ٹیبل میں ہر کالم کو کیسے بنایا جاتا ہے؟",
        content: "<td>",
        
        
        
    },
    {
        Id: "84",
        question: "افقی لائن لگانے کے لئے کونسا ٹیگ استعمال ہوتا ہے؟ ",
        content: "<hr>",
        
        
        
    },
    {
        Id: "85",
        question: "ایٹری بیوٹ سے کیا مراد ہیں ؟ ",
        content: "یہ کسی بھی ٹیگ کے متعلق معلومات فراہم کرتے ہیں۔ ",
        
        
        
    },
    {
        Id: "86",
        question: "ویب پیج کو کیسے بنایا جاتا ہے؟ ",
        content: "استعمال کرکے ،  Text Edit, Notepade, Notepad++",
        
        
        
    },
    {
        Id: "87",
        question: "ایچ ٹی ایم ایل عناصر کی تعداد کتنی ہے۔ ",
        content: " عناصر کی تعداد دو ہے۔  ہائپر ٹیکسٹ اور مارک اپ لینگوئج ",
        
        
        
    },
    {
        Id: "88",
        question: "سپیس کے لئے کونسا ٹیگ استعمال کیا جاتا ہے؟ ",
        content: "&nbsp; ",
        
        
        
    },
    {
        Id: "89",
        question: "کال سپین سے کیا مراد ہے؟ ",
        content: "ایک سیل کوایک سے زائد سیلز پر پھیلانے کے لئے ہم ٹیبل کے ایٹری بیوٹ کال سپین کا استعمال کرتے ہیں۔ ",
        
        
        
    },
    {
        Id: "90",
        question: "رو  سپین سے کیا مراد ہے؟ ",
        content: "اگر ہم ایک قطار کو ایک سے زائد قطاروں تک پھیلانا چاہتے ہوں ۔",
        
        
        
    },
    
  ];
  