export const note = [
    {
        Id: "91",
        question: "پروگرامر کی تعریف لکھیں۔ ",
        content: "ایسا شخص جو کوڈ لکھتا ہے ، کوڈ میں تبدیلی کرتا ہے اور کوڈ کو ٹیسٹ کرتا ہے۔ کمپیوٹر پراگرام بناتا ہے۔ اسے پروگرامر کہتے ہیں۔ ",
        
        
        
    },
    {
        Id: "92",
        question: "کمپیوٹر پراگرام سے کیا مراد ہے؟",
        content: "ہدایات کا مجموعہ جو مخصوص کام سر انجام دیتا ہے۔ ",
        
        
        
    },
    {
        Id: "93",
        question: "پروگرام کا مین سیکشن کیا ہے؟",
        content: "یہ کوڈ کا مین سیکشن ہے۔ یہاں سے کمپائلر کوڈ کو ایگزیکیوٹ کرتا ہے۔  یہاں ہدایات لکھی جاتی ہیں۔ ",
        
        
        
    },
    {
        Id: "94",
        question: "ہیڈر فائل سے کیا مراد ہے؟ ",
        content: "ایسی فائل  جو سی فنکشن ڈکلیریشن  پر مشتمل ہوتی ہے۔  اور سورس فائل  میں شئیر کی جاتی ہے۔ ",
        
        
        
    },
    {
        Id: "95",
        question: "لنک سیکشن سے کیا مراد ہے؟ ",
        content: "یہ کمپائلر کو سسٹم لائبریری کے ساتھ لنک کرنے کے لئیے ہدایات دیتا ہے۔ ",
        
        
        
    },
    {
        Id: "96",
        question: "سی پروگرام کی ساخت کے اہم حصے بیان کریں۔",
        content: "Documentation, Link, Definition, Global Declaration, Main Function",
        
        
        
    },
    {
        Id: "97",
        question: "چار ڈیٹا ٹائپ اور انٹ ڈیٹا  ٹائپ میں فرق بتائیں۔",
        content: "یہ کریکٹر ڈیٹا کو سٹور کرتا ہے۔ اور انٹ  نمیرک ڈیٹا کو سٹور کرتا ہے۔ ",
        
        
        
    },
    {
        Id: "98",
        question: "مین فنکشن باڈی کیا ہوتی ہے؟",
        content: "یہ مختلف سٹیمنٹس پر مشتمل ہوتی ہے اور بتاتی ہے کہ فنکشن کیا کام کرے گا۔ ",
        
        
        
    },
    {
        Id: "99",
        question: "متغیرات کیا ہوتے ہیں؟ اسکی اقسام بتائیں۔",
        content: "یہ ڈیٹا کو عارضی طور پر محفوظ کرتے ہیں۔ یہ مختلف قسم کی ویلیوز کو سٹور کرتے ہیں۔ ",
        
        
        
    },
    {
        Id: "100",
        question: "متغیرات کو ڈکلئیر کرنا اور ۔",
        content: "Int num, string name, char gender",
        
        
        
    },
    {
        Id: "101",
        question: "متغیرات کے نام رکھنے کے اصول بیان کریں۔",
        content: "حرف سے شروع ہوتے ہیں۔ نمبر سے شروع نہیں ہو سکتے۔",
        
        
        
    },
    {
        Id: "102",
        question: "آئی ڈی ای کی تعریف بیان کریں۔",
        content: "Integrated Development Environment",
        
        
        
    },
    {
        Id: "103",
        question: "  متغیرات کی انشیلائزیشن کریں",
        content: "Int num = 10 , string name = “Husnain”, char  gender = ‘M’",
        
        
        
    },
    {
        Id: "104",
        question: "متغیرات کی ڈیٹا  ٹائپ سے کیا مراد ہے؟",
        content: "یہ  بتاتے ہیں کہ متغیر کس قسم کے ڈیٹا پر مشتمل ہو سکتا ہے۔ انٹ ، سٹرنگ یا کریکڑ۔ ",
        
        
        
    },
    {
        Id: "105",
        question: "پروگرامنگ میں کمنٹس کا استعمال اور اسکی اقسام؟",
        content: "پروگرام کے بارے میں لکھے جاتے ہیں۔ اسکی دو اقسام ہیں۔ سنگل لائن اور ملٹی لائن کمنٹس ۔ کمپائلر کمنٹس کو نظر انداز کر دیتا ہے۔  ",
        
        
        
    },
    {
        Id: "106",
        question: "کی ورڈ سے کیا مراد ہے؟ چار کی ورڈ لکھیں۔",
        content: "یہ کمپائلر کے لئے خاص معنی رکھتے ہیں۔ ",
        
        
        
    },
    {
        Id: "107",
        question: "پروگرام فائل بنانے کے مراحل بیان کریں۔",
        content: "Click File …> New …….> Blank Project",
        
        
        
    },
    {
        Id: "108",
        question: "کمپائلر کی تعریف اور اسکے مقصد کی وضاحت کریں",
        content: "یہ ہائی لیول لینگوئج میں لکھے گئے سورس کوڈ کو مشین کوڈ میں یا دوسری لینگوئج میں تبدیل کر دیتا ہے۔  یہ ٹرانسلیٹر کا کام کرتا ہے۔ ",
        
        
        
    },
    {
        Id: "109",
        question: "ڈی بگنگ سے کیا مراد ہے؟ ",
        content: "غلطیاں تلاش کرنا اور پھر اسے دور کرنے کا عمل ڈی بگنگ کہلاتا ہے۔ ",
        
        
        
    },
    {
        Id: "110",
        question: "ٹیکسٹ ایڈیٹر سے کیا مراد ہے؟ ",
        content: "کمپیوٹر پروگرام جو ٹیکسٹ  کو ٹھیک کرتا ہے۔ ٹیکسٹ کو لکھتا ہے۔ جہاں پروگرام لکھا جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "111",
        question: "پروگرامنگ لینگوئج کے نام بتائیں۔",
        content: "C, C++, Java",
        
        
        
    },
    {
        Id: "112",
        question: "گرافیکل یوزر انٹر فیس سے کیا مراد ہے؟",
        content: "یوزر اسکی مدد سے گرافیکل آئکن کو استعمال کر سکتا ہے۔ یہ سکرین  پر آبجیکٹ دکھاتا ہے۔ جو ہمیں معلومات فراہم کرتے ہیں۔  ",
        
        
        
    },
    {
        Id: "113",
        question: "ری لیشنل ایکسپریشن سے کیا مراد ہے؟",
        content: "دو قیمتوں کے تعلق کا تعین کرنے کے لئے انکا موازانہ کرتے ہیں۔ دونوں قیمتیں برابر ہیں یا برابر نہیں ہیں۔ ",
        
        
        
    },
    {
        Id: "114",
        question: "ری لیشنل آپریٹرز کیا ہیں؟   کون کونسے ری لیشنل  آپریٹرز ہیں۔ ",
        content: "ایسا آپریٹر جو دو مقداروں کا موازانہ کرنے کیلئے استعمال ہوتا ہے۔ تمام ریلشنل آپریٹرز بائنری آپیریٹرز ہیں۔ ",
        
        
        
    },
    {
        Id: "115",
        question: "لوجیکل  آپریٹرز کیا ہیں۔ مثال دیں۔ ",
        content: "بولین ایکسپریشنز پر آپریشنز سر انجام دیتے ہیں اور جواب بھی ایک بولین ایکسپریشن ہوتا ہے۔ اینڈ ، اور ، ناٹ ",
        
        
        
    },
    {
        Id: "116",
        question: "یونری  آپریٹرز کیا  ہے؟ ",
        content: "یونری آپریٹرز کے لئے صرف ایک آپرینڈ درکار ہوتا ہے۔  مثال ناٹ اور سائن آپریٹر 5۔ ",
        
        
        
    },
    {
        Id: "117",
        question: "بائنری  آپریٹرز کیا ہے؟",
        content: "بائنری آپریٹرز کے لئے دو آپرینڈ درکا ر ہوتے ہیں۔ تمام ارتھمیٹک اور ریلشنل آپریٹرز۔",
        
        
        
    },
    {
        Id: "118",
        question: "آپریٹرز کی ترجیح سے کیا مراد ہے؟ کس کی ترجیح سب سے زیادہ ہے",
        content: "کون سا آپریشن پہلے انجام دینا ہے۔ مختلف آپریٹرز کی مختلف ترجیح ہوتی ہے۔ جسکی ترجیح زیادہ ہو انہیں پہلے حل کیا جاتا ہے",
        
        
        
    },
    {
        Id: "119",
        question: "فنکشنز میں کیا فرق ہے؟   Getche     اور     Getch() ",
        content: "یہ صارف سے کریکٹران پٹ لینے کے لئے استعمال ہوتا ہے۔  صارف سے ایک کریکٹر لینے کے لئے استعمال ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "120",
        question: "اسکیپ سیکوینس کیا ہیں؟  انکی ضرورت کیوں ہوتی ہے؟ ",
        content: "یہ پرنٹ ایف کو بتاتا ہے کہ معمول سے ہٹ کر  مخصوص کام کرنا ہے جو انسے منسوب کیا گیا ہے۔ ",
        
        
        
    },
    {
        Id: "121",
        question: "سی لینگوئج میں اسکیپ سیکوینس  کی وضاحت کریں۔ ",
        content: "اس میں دو کریکٹر ہوتے ہیں پہلا بیک سلیش   یعنی اسکیپ کریکٹر اور دوسرا فنکشنلیٹی کے مطابق آتا ہے۔",
        
        
        
    },
    {
        Id: "122",
        question: "اسکیپ سیکوینس کا استعمال تحریر کریں۔ ",
        content: "الرٹ کی آواز پیدا کرنا، پچھلا کریکٹر مٹانا،  افقی طور پر اگلے ٹیب سٹاپ پر بھیجنا ، اگلی لائن پر جانا ",
        
        
        
    },
    {
        Id: "123",
        question: "آپریٹرز کیا ہوتے ہیں؟ ",
        content: "ڈیٹا پر عوامل سر انجام دینے والی علامت آپریٹر کہلاتی ہے۔ اسائنمنٹ آپریٹرز، ریلیشنل ، ارتھمیٹک اور منطقی آپریٹرز ",
        
        
        
    },
    {
        Id: "124",
        question: "سی لینگوئج میں استعمال ہونے والے چار  آپریٹرز کے نام لکھیں۔ ",
        content: "ارتھمیٹک آپریٹرز، ری لیشنل آپریٹرز، لوجیکل آپریٹرز، با ئنری آپریٹرز",
        
        
        
    },
    {
        Id: "125",
        question: "اسائنمنٹ  آپریٹرز کی تعریف کریں۔ ",
        content: "اسائنمنٹ آپریٹر   جو ویری ایبل کو قیمت اسائن کرنے کو استعمال ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "126",
        question: "ارتھمیٹک  آپریٹرز کی تعریف کریں۔  نیز نام لکھیں۔",
        content: "ڈیٹا پر ارتھمیٹک آپریشنز انجام دینے کے لئے استعمال ہوتے ہیں۔   جمع ، تفریق ، ضرب ، ٹقسیم",
        
        
        
    },
    {
        Id: "127",
        question: "     آپریٹرز کیا ہے؟    ==  ",
        content: "  جبکہ    ریلشنل  آپریٹر ہے۔  جو چیک کرتا ہے کہ دو ایکسپریشن برابر ہیں یا نہیں۔            ",
        
        
        
    },
    {
        Id: "128",
        question: "ماڈولس  آپریٹرز کا استعمال لکھئے۔ ",
        content: "ایک بائنری آپریٹرز ہے جو بائیں آپرینڈ کو دائیں آپرینڈ پر تقسیم کرتا ہے اور بچنے والی رقم جواب ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "129",
        question: "اینڈ  آپریٹرز کا استعمال تحریر کریں۔ ",
        content: "اینڈ آپریٹر دو بولین ایکسپریشنز بطور آپرینڈ لیتا ہے۔  اور جواب اسی صورت میں درست ہوتا ہے جب دونوں آپرینڈ ٹرو ہو",
        
        
        
    },
    {
        Id: "130",
        question: "اور ناٹ آپریٹرز کا استعمال تحریر کریں۔",
        content: "بولین ایکسپریشنز کی قیمت کو الٹ کر دیتا ہے۔ اگر درست ہو تو غلط اور اگر غلط ہو تو درست کر دیتا ہے۔ ",
        
        
        
    },
    {
        Id: "131",
        question: "اور آپریٹرز کا استعمال تحریر کریں۔",
        content: "بولین ایکسپریشن لیتا ہے اور اگر کوئی ایک بھی آپرینڈ درست ہو تو جواب درست ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "132",
        question: "سٹیمنٹ ٹرمینیٹر کیا ہے؟ ",
        content: "یہ کمپائلر کو بتاتا ہے کہ لائن ختم ہوگئی ہے۔ سی لینگوئج میں سیمی کولن    بطور سٹیمنٹ ٹرمینیٹر استعمال ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "133",
        question: "فارمیٹ سپیسفائرز سے کیا مراد ہے؟ کیوں ضروری ہے؟ ",
        content: "ان پٹ اور آؤٹ پٹ آپریشنز میں ڈیٹا کا فارمیٹ بتانے کے لئے استعمال ہوتا ہے۔ ٪ سائن آتا ہے۔ ",
        
        
        
    },
    {
        Id: "134",
        question: "ان پٹ آوٹ پٹ کے لئے کون سے فنکشن استعمال ہوتے ہیں۔ ",
        content: "سکین ایف صارف سے ان پٹ لینے اور پرنٹ ایف سکرین پر فارمیٹیڈ آوٹ پٹ دکھانے کو استعمال ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "135",
        question: "آپریٹرز کی ترجیح بیان کریں۔ ",
        content: "( ) ,      ! ,     * , / , %,  + , - ,  < ,   > ,   >= ,    <= ,     ==,   != ,  &&,   || , =",
        
        
        
    },
    {
        Id: "136",
        question: "کنٹرول سٹیمنٹس کی تعریف بیان کریں۔نیز اقسام بھی لکھیں۔  ",
        content: "جو  سٹیمنٹ پر عمل درآمد کی ترتیب کو تبدیل کرنے کے لئے استعمال ہوتی ہیں۔ کنٹرول  سٹیمنٹ کہلاتی ہیں۔ ",
        
        
        
    },
    {
        Id: "137",
        question: "سلیکشن   سٹیمنٹس  کیا ہیں ۔",
        content: "وہ  سٹیمنٹس جو شرائط کی بنا پر فیصلہ کرتی ہیں کہ آگے کونسی سٹیمنٹس چلنی چائیے۔ سلیکشن  سٹیمنٹس کہلاتی ہیں۔",
        
        
        
    },
    {
        Id: "138",
        question: "سلیکشن   سٹیمنٹس  کی اقسام کے نام لکھیں۔",
        content: "اف سٹمیمنٹ    ،    اف ایلس سٹیمنٹ",
        
        
        
    },
    {
        Id: "139",
        question: "اف  سٹیمنٹس اور ایلس  سٹیمنٹ میں فرق بیان کریں۔",
        content: "اگر شرط کا نتیجہ درست ہو گا تو اف  سٹیمنٹ چلے گی اگر شرط کا نتیجہ غلط ہوگا تو ایلس  سٹیمنٹ چلے گی۔",
        
        
        
    },
    {
        Id: "140",
        question: "کنڈیشن سے کیا مراد ہے؟",
        content: "کوئی بھی درست ایکسپریشن ہو سکتی ہے۔  جیسے ارتھمیٹک ایکسپریشنز، ریلیشنل ایکسپریشنز ، لاجیکل ایکسپریشنز یا انکا مجموعہ",
        
        
        
    },
    {
        Id: "141",
        question: "کنڈیشنل  سٹیمنٹس کی تعریف بیان کریں۔",
        content: "کنڈیشنل  سٹیمنٹس بتاتی ہیں کہ پروگرام کی  سٹیمنٹس کس ترتیب سے ایگزیکیوٹ ہوں گی۔",
        
        
        
    },
    {
        Id: "142",
        question: "سیکوئنشل کنٹرول کی تعریف بیان کریں۔",
        content: "سیکوئنشل کنٹرول  سٹرکچر میں تمام  سٹیمنٹس دی گئی ترتیب کے مطابق چلتی ہیں۔",
        
        
        
    },
    {
        Id: "143",
        question: "اف سٹیمنٹ سے کیا مراد ہے؟ ",
        content: "شرط بتا کر اس سے کوڈ منسوب کر سکتے ہیں ۔ یہ کوڈ تب چلتا ہے اگر شرط پوری ہو جائے ورنہ نہیں چلتا۔ ",
        
        
        
    },
    {
        Id: "144",
        question: "اف ایلس سٹیمنٹ سے کیا مراد ہے؟ ",
        content: "ہدایات  کا ایک سیٹ تب چلے اگر شرط پوری ہو جائے اگر شرط پوری نہ ہو تو کوئی دوسرا سیٹ  یعنی ایلس چلے۔ ",
        
        
        
    },
    {
        Id: "145",
        question: "نیسٹڈ اف کیا ہے؟",
        content: "اگر اف  سٹیمنٹ کے اندر ایک اور اف  سٹیمنٹ ہو تو یہ نیسٹڈ اف کہلاتا ہے۔",
        
        
        
    },
    {
        Id: "146",
        question: "نیسٹڈ سلیکشن  سٹرکچر کی تعریف بیان کریں۔",
        content: "اف یا ایلس بلاک کے اندر ہم مزید اف یا ایلس سٹیمنٹس لکھ سکتے ہیں۔ اور ہم یہ کام جتنی بار چاہیں کر سکتے ہیں۔  ",
        
        
        
    },
    {
        Id: "147",
        question: "بلاک / کمپاؤنڈ سٹیمنٹ سے کیا مراد ہے؟",
        content: "بریکٹ میں بند ایک سے زیادہ ہدایات کا مجموعہ بلاک  یا کمپاؤنڈ سٹیمنٹ کہلاتا ہے۔",
        
        
        
    },
    {
        Id: "148",
        question: "لوپ سے کیا مراد ہے؟ نیز اسکی اقسام بھی لکھیں۔ ",
        content: "ایک  سٹیمنٹس کو بار بار چلانا / ایگیزیکیوٹ کرنا لوپ کہلاتا ہے۔  وائل لوپ، ڈو وائل لوپ اور فار لوپ ",
        
        
        
    },
    {
        Id: "149",
        question: "ڈیٹا سٹرکچر کی تعریف کریں۔ ",
        content: "ڈیٹا سٹرکچر ایک کنٹینر ہوتا ہے جو ڈیٹا آئٹمز کے مجموعے کو ایک خاص ترتیب میں محفوظ کرنے کے لئے استعمال ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "150",
        question: "ارے  کی تعریف کریں۔",
        content: "ارے ایک ڈیٹا سٹرکچر ہے۔  جو ایک ہی ٹائپ کی ویلیوز کو محفوظ کر سکتی ہے۔ ",
        
        
        
    },
    {
        Id: "151",
        question: "ارے انشیلائزیشن  کی تعریف کریں۔ نیز طریقہ بیان کریں۔ ",
        content: "پہلی دفعہ ارے کے ارکان میں ویلیو محفوظ کرنے کا عمل انشیلائزیشن  کہلاتا ہے۔  ارے ارکان کی ویلیوز کو    میں لکھا جاتا ہے۔",
        
        
        
    },
    {
        Id: "152",
        question: "لوپ سٹرکچر  کی تعریف کریں۔",
        content: "ہدایات کے مجموعے کو بار بار دہرائے جانے کا عمل لوپ کہلاتا ہے۔ ",
        
        
        
    },
    {
        Id: "153",
        question: "نیسٹڈ لوپس  کی تعریف کریں۔",
        content: "لوپ کے اندرایک اور  لوپ کا استعمال نیسٹڈ لوپس کہلاتا ہے۔ ",
        
        
        
    },
    {
        Id: "154",
        question: "کیا لوپ ایک ڈیٹا سٹرکچر ہے؟ ",
        content: "نہیں۔ ",
        
        
        
    },
    {
        Id: "155",
        question: "ایک ارے کو ڈیکلیریشن کے وقت انشیلائز کرنے کا فائدہ کیا ؟ ",
        content: "ہمیں اسکی میموری کے سائز کا اندازہ ہو جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "156",
        question: "ارے ڈییکلیریشن کیا ہے نیز ارے کو کیسے ڈکلیر کر سکتے ہیں؟ ",
        content: "ارے کی ڈیٹا ٹائپ ، نام  اور ارے کے سائز ظاہر کرنے کاعمل ڈیکلیریشن کہلاتا ہے۔  ",
        
        
        
    },
    {
        Id: "157",
        question: "ارے ویلیوز کو کس طرح میموری میں محفوظ کرتی ہیں؟ ",
        content: "ارے کے ایلیمنٹس میموری کے منسلک مقامات پرمحفوظ ہوتی ہیں۔    ",
        
        
        
    },
    {
        Id: "158",
        question: "ارے کے ارکان تک رسائی کیسے حاصل کی جاتی ہے؟ ",
        content: "ارے کے ارکان تک رسائی حاصل کرنے  کے لئے اس رکن کا انڈکس نمبر استعمال کیا جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "159",
        question: "لوپ باڈی سے کیا مراد ہے؟ ",
        content: "اس میں کوڈ لکھا ہوتا ہے جو بار بار رپیٹ ہونا ہوتا ہے۔ ",
        
        
        
    },
    {
        Id: "160",
        question: "کنڈیشن کے بعد لوپ کا کون سا حصہ ایگزیکیوٹ ہوتا ہے؟ ",
        content: " اگر کنڈیشن درست ہو تو لوپ کی باڈی چلتی ہے۔  اسکے بعد کاؤنٹر ویری ایبل میں لاجک کیمطابق اضافہ یا کمی ہوتی ہے۔ ",
        
        
        
    },
    {
        Id: "161",
        question: "اگر لوپ میں موجود کنڈیشن پہلی مرتبہ ہی غلط ہو تو کیا ہو گا؟ ",
        content: "پروگرام لوپ سے باہر آجائے گا۔",
        
        
        
    },
    {
        Id: "162",
        question: "فار لوپ کا سنٹیکس لکھئے۔ ",
        content: "for  (int i = 0; i < 5; i ++ )",
        
        
        
    },
    {
        Id: "163",
        question: "فار لوپ کے انشیلائزیشن حصہ کی وضاحت کریں۔ ",
        content: "یہ سب سے پہلے ایگزیکیوٹ ہوتا ہے ۔اس میں ہم کاؤنٹر ویری ایبل کو انشیلائز کرتے ہیں ۔  یہ لوپ کا سٹارٹنگ پوائنٹ ہے۔",
        
        
        
    },
    {
        Id: "164",
        question: "فار لوپ کے کنڈیشن حصہ کی وضاحت کریں۔ ",
        content: "کنڈیشن چیک ہوتی ہے۔ اگر یہ غلط ہو تو ہم لوپ سے باہر آجاتے ہیں۔  ",
        
        
        
    },
    {
        Id: "165",
        question: "فار لوپ میں انکریمنٹ / ڈیکریمنٹ کیوں استعمال کیا جاتا ہے؟",
        content: "انکریمنٹ کا استعمال ویلیو میں اضافہ کرنے کے لئے جبکہ ڈیکریمنٹ کا استعمال ویلیو میں کمی کرنے کے لئے کیا جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "166",
        question: "لوپس کو استعمال کرنے کے دو مقاصد بیان کریں۔",
        content: "لوپس کے ذریعے اریز میں قیمتیں لکھنا آسان ہوجاتا ہے۔  لوپس کے ذریعے اریز میں قیمتیں پڑھناآسان ہوجاتا ہے۔",
        
        
        
    },
    {
        Id: "167",
        question: "ارے کو کیسے ڈکلئیر کیا جاتا ہے؟ ",
        content: "     سے [ ] ",
        
        
        
    },
    {
        Id: "168",
        question: "انشیلائزکرتے وقت  ارے کے ارکان کی ویلیوز کو لکھا جاتا ہے؟",
        content: "سے   {}",
        
        
        
    },
    {
        Id: "169",
        question: "انشیلائزکرتے وقت  ارے کے ارکان کی ویلیوز کو علیحدہ کرتے ہے؟",
        content: "کوما سے",
        
        
        
    },
    {
        Id: "170",
        question: "ارے کے ایلیمنٹس کہاں محفوظ ہوتے ہیں؟ ",
        content: "ارے کے ایلیمنٹس میمور ی کے مقامات  منسلک پر محفوظ  ہوتے ہیں۔ ",
        
        
        
    },
    {
        Id: "171",
        question: "فنکشنز کی تعریف کریں ۔ ",
        content: "فنکشن سٹیمنٹس کا ایک بلاک ہے جو کہ ایک خاص کام انجام دیتا ہے۔ صارف کے مطلوب افعال پروگرام کو سرانجام دیتا",
        
        
        
    },
    {
        Id: "172",
        question: "بلٹ ان فنکشنز کی تعریف کریں۔ ",
        content: "وہ  فنکشن جو سی کی سٹینڈرڈ لائبریری میں موجود ہیں۔ بلٹ ان  فنکشن کہلاتے ہیں۔",
        
        
        
    },
    {
        Id: "173",
        question: "یوزر ڈیفائنڈ  فنکشنز کی تعریف کریں۔",
        content: "وہ  فنکشنز جو پروگرامر ڈیفائن کرتا ہے یوزر ڈیفائن فنکشنز کہلاتے ہیں۔  یہ یوزر خود بناتا ہے۔ ",
        
        
        
    },
    {
        Id: "174",
        question: "فنکشن پیرا میٹرز کی تعریف کریں۔ ",
        content: "فنکشن کچھ ان پٹ لیتا ہے۔  فنکشن کی ان پٹس کو پیرامیٹرز کہتے ہیں۔ ایک فنکشن کے ایک سے زیادہ پیرامیٹرز ہو سکتے ہیں۔ اسے کوما سے علیحدہ کیا جاتا ہے۔  یہ فنکشن ہیڈر میں استعمال ہونے والے متغیرات ہوتے ہیں۔ ",
        
        
        
    },
    {
        Id: "175",
        question: "ریٹرن وہلیو سے کیا مراد ہے؟ ",
        content: "اور آوٹ پٹ کو ریٹرن ویلیو کہتے ہیں۔ فنکشن ایک ہی قیمت ریٹرن کر سکتا ہےزیادہ نہیں۔ ",
        
        
        
    },
    {
        Id: "176",
        question: "فنکشن سگنیچر کی تعریف کریں۔",
        content: "فنکشن  کا نام ، ریٹرن ٹائپ  اور پیرامیٹرز واضح کرنے کا عمل فنکشن  سگنیچر کہلا تا ہے یہ فنکشن پروٹو ٹائپ بھی کہلاتا ہے۔",
        
        
        
    },
    {
        Id: "177",
        question: "فنکشن کے فوائد بیان کریں۔ ",
        content: "دوبارہ استعمال کرنا ،  کاموں کو الگ کرنا ،  مسئلے کی پچیدگی سے نمٹنا ،   پڑھنے کی صلاحیت ",
        
        
        
    },
    {
        Id: "178",
        question: "فنکشن کی اقسام بیان کریں۔",
        content: "بلٹ ان فنکشن  ،          یوزر ڈیفائنڈ  فنکشن",
        
        
        
    },
    {
        Id: "179",
        question: "فنکشن کو ڈیفائن کرنا سے کیا مراد ہے؟ ",
        content: "ایک فنکشن کے سگنیچر سے یہ پتا نہیں چلتا کہ وہ کس کام کے لئے ہے۔ اس کےلئے فنکشن ڈیفینیشن ہوتی ہے۔",
        
        
        
    },
    {
        Id: "180",
        question: "فنکشن کی باڈی سے کیا مراد ہے؟ ",
        content: "فنکشن کی باڈی ان سٹیٹمنٹس کا سیٹ ہوتا ہے جنہیں چلا کر فنکشن کوئی خاص کام سر انجام دیتا ہے۔  فنکشن سگنیچر کے فورا بعد  قوسین میں لکھی گئی سٹیٹمنٹس  فنکشن کی باڈی بناتی ہے۔ ",
        
        
        
    },
    {
        Id: "181",
        question: "فنکشن کے اندر ریٹرن سے کیا مراد ہے؟ ",
        content: "فنکشن کے اند ر ریٹرن ایک مطلوبہ لفظ ہے جو کالنگ فنکشن کی قیمت کو ریٹرن کرنے کے لئے استعمال ہوتا ہے۔  ایک فنکشن ایک سے زیادہ قیمتیں ریٹرن نہیں کر سکتا۔ ورنہ کمپائلر ایرر دیتا ہے۔ ایک فنکشن میں ایک سے زیادہ ریٹرن سٹیٹمنٹس ہو سکتی ہیں ",
        
        
        
    },
    {
        Id: "182",
        question: "فنکشن کا استعمال کیسے کیا جاتا ہے؟ ",
        content: "ہمیں ایک فنکشن کو کال کرنا پڑتا ہے تاکہ وہ پروگرام کو سونپا گیا کام انجام دے۔ فنکشن کال کے لئے یہ ڈھانچہ  ہے۔ ",
        
        
        
    },
    {
        Id: "183",
        question: "فنکشن کو کال کرنے سے کیا مراد ہے؟",
        content: "جب کوئی فنکشن کال آتی ہے تو کنٹرول اس فنکشنز کو ٹرانسفر ہوجاتا ہے۔ کال کئے گئے فنکشن کے ایگزیکیوٹ ہونے کے بعد کنڑول واپس اس فنکشن کے پاس چلا جاتا ہے جس نے فنکشن کال کیا ہوتا ہے۔",
        
        
        
    },
    {
        Id: "184",
        question: "فنکشن کی کال کب ختم ہوتی ہے؟",
        content: "جیسے ہی ایک ریٹرن سٹیٹمنٹ چلتی ہے فنکشن کی کال ختم ہوجاتی ہے فنکشن کی باڈی کی باقی سٹیٹمنٹس نہیں چلتی۔",
        
        
        
    },
    {
        Id: "185",
        question: "ریٹرن ٹائپ سے کیا مراد ہے؟ ",
        content: "فنکشن کے نام سے پہلے جو ڈیٹا ٹائپ ظاہر کی جاتی ہے اسے ریٹرن ٹائپ کہا جاتا ہے۔ ",
        
        
        
    },
    {
        Id: "186",
        question: "آرگیومنٹس کیا ہوتے ہیں؟",
        content: "فنکشن کو پاس کی گئی قیمتیں آرگیومنٹس کہلاتی ہیں۔ آرگیومنٹس اور پیرامیٹرز کی ٹائپ ایک جیسی ہونی چاہیے۔",
        
        
        
    },
]